import React from 'react'
import styles from '../common.less'

interface OrderContractProps {
  agreement: any
}
// 享换机用户协议
const OrderContract: React.FunctionComponent<OrderContractProps> = ({ agreement }) => {
  const userInfo = agreement.get('user_info')
  const skuInfo = agreement.get('sku_info')
  const tradeInfo = agreement.get('trade_info')
  const payType = tradeInfo.get('pay_type') // 支付方式 1.信用免押 2.花呗预授权 0.未知的支付方式
  return (
    <div className={styles.container}>
      <h1>享换机服务协议</h1>
      <p>甲 方：晋松（上海）网络信息技术有限公司</p>
      <p>甲方地址：上海市杨浦区国定路323号1002-75室</p>
      <p>甲方联系方式：400-670-0188</p>
      <br />
      <p>
        乙 方：<span className={styles.fill}>{userInfo.get('user_name')}</span>
      </p>
      <p>
        乙方身份证号：<span className={styles.fill}>{userInfo.get('user_id_card')}</span>
      </p>
      <p>
        乙方联系方式：<span className={styles.fill}>{userInfo.get('user_phone')}</span>
      </p>
      <br />
      <p>鉴于</p>
      <p>
        1.甲方是一家在上海市内依法成立并有效存续的有限公司（以下简称“享换机”或“甲方”）。自设立以来，甲方专注于为用户提供设备使用服务。
      </p>
      <p>2.乙方为年满18周岁具有完全民事行为能力的自然人，因具有设备使用的需求，有意接受甲方提供的设备使用服务。</p>
      <p>3.甲乙双方经友好协商一致，签署本《享换机用户协议》（下称“本协议”）</p>
      <h2>一、基本信息</h2>
      <p>
        订单编号：<span className={styles.fill}>{agreement.get('trade_no')}</span>
      </p>
      <p>
        设备型号：<span className={styles.fill}>{skuInfo.get('sku_name')}</span>
      </p>
      <p>
        服务期限：<span className={styles.fill}>{tradeInfo.get('lease_term_periods')}</span>个月
      </p>
      <p>
        服务期数：<span className={styles.fill}>{tradeInfo.get('lease_term')}</span>期
      </p>
      <p>
        每期费用：<span className={styles.fill}>{tradeInfo.get('term_rent_price')}</span>元
      </p>
      <p>
        服务期间：设备签收日（服务起始日）起至<span className={styles.fill}>{tradeInfo.get('lease_term_periods')}</span>个自然月后的日期（服务到期日）；
      </p>
      <p>最后还机日：服务到期日后第7个自然日；</p>
      <p>
        服务费总额：<span className={styles.fill}>{tradeInfo.get('service_total_price')}</span>元（其中包含设备折旧费<span
          className={styles.fill}
        >
          {tradeInfo.get('depreciation_price')}
        </span>元，信用评估、物流、质检、回收处置、意外维修、隐私处理等其他服务费<span className={styles.fill}>
          {tradeInfo.get('other_service_price')}
        </span>元）；
      </p>
      {payType === 0 && (
        <p>
          担保方式：<span className={styles.fill} />
        </p>
      )}
      {payType === 1 && (
        <>
          <p>
            预付服务费期数：<span className={styles.fill}>{tradeInfo.get('prepay_installments_num')}</span>；
          </p>
          <p>
            预付服务费总额：<span className={styles.fill}>{tradeInfo.get('prepay_price')}</span>元；
          </p>
        </>
      )}
      {payType === 2 && (
        <>
          <p>
            押金总额：<span className={styles.fill}>{tradeInfo.get('deposit_total_price')}</span>元；
          </p>
          <p>
            押金支付方式：<span className={styles.fill}>{tradeInfo.get('deposit_pay_type')}</span>；
          </p>
          {/* {type === 'huabei' && <p>花呗预授权（其中信用减免<span
           className={styles.fill}></span>元，实际冻结<span
         className={styles.fill}></span>元）；</p>}
            {type === 'credit' && <p>信用卡预授权；</p>}
            {type === 'third' && <p>使用第三方借款或授信额度支付（实际借款支付<span
           className={styles.fill}></span>元。另冻结花呗预授权元）；</p>} */}
        </>
      )}
      <p>
        意外维修服务费：<span className={styles.fill}>{tradeInfo.get('ap_service_price')}</span>元；
      </p>
      <p>
        到期买断设备剩余费用：<span className={styles.fill}>{tradeInfo.get('residual_value_price')}</span>元。
      </p>
      <h2>二、各方权利义务</h2>
      <p>2.1 甲方的权利义务：</p>
      <p>
        2.1.1
        甲方有权根据相关适用法律，将在服务关系建立和存续期间获得的乙方个人基本信息、债务信息、信用信息（即适用法律规定的对乙方信用状况的客观状态）等有关信息，在乙方逾期超过30天的情况下，反馈给相关司法部门、征信管理机构、行业监督管理机构等以督促乙方履行义务。
      </p>
      <p>
        2.1.2
        根据相关监管要求，甲方对乙方的个人基本信息、债务信息、信用信息等有关信息有权予以保留。甲方对该等信息负有保密的义务，除根据相关法律法规、本协议的相关约定、或出于为乙方提供更好的服务之目的、需将乙方信息进行对外提供的情形之外，未经乙方允许，甲方不得擅自将乙方信息披露或提供给任何与协议无关的其他方。
      </p>
      <p>
        2.1.3 甲方保证提供给乙方的<span className={styles.fill}>{skuInfo.get('sku_new')}</span>商品，为<span
          className={styles.fill}
        >
          {skuInfo.get('sku_channel')}正品
        </span>。
      </p>
      <p>
        2.1.4
        甲方承诺不泄漏乙方在设备中留存的个人信息。对于乙方归还的设备，甲方将抹除设备所有数据，并将其恢复至出厂设置。甲方无义务保存或保管设备中相关信息。
      </p>
      <p>
        2.1.5
        甲方承诺乙方若在现有订单到期前30天内提交新订单，则新订单到期时间可免费顺延7天，用于新旧机间的数据迁移。服务费划款的时间同步顺延。
      </p>
      {payType !== 1 ? (
        <>
          <p>
            2.1.6
            甲方承诺不在协议范围外使用押金预授权额度（含花呗、信用卡预授权），乙方另行授权的情形除外。由于甲方误用预授权额度导致的乙方损失由甲方承担。
          </p>
          <p>
            2.1.7
            甲方承诺乙方当出现如乙方还机有金额未结算清，甲方将提供乙方买断选项30天，若乙方买断则物权转移至乙方，超过30天乙方默认还机，甲方有权处置机器。
          </p>
          <p>
            2.1.8
            甲方承诺乙方，当出现异常如甲方收到机器，乙方决定买断后联系不上，乙方支付买断后，甲方最长代管3个月，超过后物权转移到甲方，甲方有权处置。
          </p>
        </>
      ) : (
        <>
          <p>
            2.1.6
            甲方承诺乙方当出现如乙方还机有金额未结算清，甲方将提供乙方买断选项30天，若乙方买断则物权转移至乙方，超过30天乙方默认还机，甲方有权处置机器。
          </p>
          <p>
            2.1.7
            甲方承诺乙方，当出现异常如甲方收到机器，乙方决定买断后联系不上，乙方支付买断后，甲方最长代管3个月，超过后物权转移到甲方，甲方有权处置。
          </p>
        </>
      )}
      <p>2.2 乙方的权利义务 ：</p>
      <p>2.2.1 乙方承诺向享换机提供的信息及时、合法、真实、有效。</p>
      {payType === 1 && <p>2.2.2 乙方应保证设备用途合法合规。</p>}
      {payType !== 1 && (
        <p>
          2.2.2 乙方应保证按照服务费支付安排按时及时足额包括不限于银行卡代扣的方式向甲方交付服务费，且设备用途合法合规。
        </p>
      )}
      <p>
        2.2.3
        若乙方已经通过第三方资金授信或资金借款形式一次性向甲方支付了租赁商品所需要的服务费和押金部分，则乙方同意并授权甲方定期向乙方收取授信服务费或每月还款本息后交付给第三方或资金方（具体以相关资金方和乙方及（或）甲方签署的授信协议或借款合同为准）。
      </p>
      <p>2.2.4 乙方同意以网络页面点击确认或其他方式（包括但不限于签字或签章确认等方式）签订本协议。</p>
      <p>
        2.2.5
        乙方应保证其指定账户状态正常，确保资金划入、划出交易的完成。如因前述指定账户不正常（如资金无法及时入账、服务费用无法划转等）导致的所有损失应由乙方承担。{' '}
      </p>
      {payType !== 1 ? (
        <>
          <p>2.2.6 乙方授权甲方冻结一定金额的第三方额度（含花呗、信用卡）作为押金预授权，并在以下情况下使用：</p>
          <p>（1）当乙方未按期支付每期服务费时，按照本协议约定将预授权金额转支付用于支付未付租金和买断的费用；</p>
          <p>
            （2）当乙方发起买断申请或发生本协议约定的买断情形时，将预授权金额的全部或部分转为支付，用于支付买断费用；
          </p>
          <p>（3）当乙方发生违约行为时，按照本协议约定将预授权金额转支付用于支付违约金、罚息；</p>
          <p>（4）当协议终止时（含买断、还机），在乙方结清所有费用后，释放所有未使用的预授权额度。</p>
          <p>2.2.7 乙方应按照本协议的约定到期向享换机申请续期、归还设备或买断设备。</p>
          <p>2.2.8 当乙方的资信状况及收入状况出现重大不利影响时，乙方应及时通知享换机或其受托人。</p>
          <p>
            2.2.9
            乙方不得以出租、转借或以其他方式将使用服务过程中的相关账户、密码、身份证件信息、手机号码、银行卡信息、住址、邮箱等信息交由任何其他第三方使用，否则由此导致的损失及相关后果由乙方承担。
          </p>
          <p>
            2.2.10
            乙方明确对于享换机进行如下授权：授权享换机及享换机委托的第三方通过合法渠道了解、咨询、审查乙方的身份信息、资信状况、财务状况和其他与评定乙方信用状况及付款能力有关的信息，并可以在享换机提供设备使用服务整个过程中及在追偿违约欠款时索取、留存和使用该信息及乙方在享换机所提供的全部资料；授权享换机接入征信机构共享系统并查询、披露乙方的相关信用信息。
          </p>
          <p>
            2.2.11
            若乙方选择物流人员上门配送设备，则乙方应根据甲方需要，配合工作人员核实设备型号、IMEI号与协议是否一致，全新设备是否已拆封，若签收时未联系客服，则视为包装完好同意签收。若不符合，应当拒收快递，并主动联系客服。
          </p>
          <p>
            2.2.12
            乙方选择的服务中包含非全新设备时，乙方在收件时需确认设备是否有账号密码、锁屏密码、访问限制密码。发现以上情况，需及时联系享换机客服。
          </p>
          <p>2.2.13 乙方归还设备时，经享换机检测认定属如下情况的，乙方应将设备予以买断： </p>
          <p>（1） 因自然灾害、被盗、遗失、人为事故等原因造成机器灭失，无法归还的；</p>
          <p>（2） 机器串码标签缺失、损坏、涂改、字迹模糊而无法确定是否为原机器的；</p>
          <p>（3） 乙方从事非法活动导致机器发生损失的；</p>
          <p>
            （4）
            机器存在毁灭性损坏，设备严重损坏、弯折、机壳分离、内屏损坏、机身内组件（线缆）断裂破损或被强行拆成数块的；
          </p>
          <p>（5） 机器进水、进液的；</p>
          <p>（6） 机器无法正常开机、无法进行系统恢复激活后读取设备序列号或IMEI编号的；</p>
          <p>（7） 机器擅自拆机、改装、维修的；</p>
          <p>（8） 机器型号、S/N号、IMEI号等在进行系统恢复后与合约记载的不符，涂改、缺失或无法辨识的；</p>
          <p>（9） 机器因加装、移除或改动硬件所造成的故障，包括因安装未授权的软件而导致的设备无法正常使用或故障。</p>
          <p>
            2.2.14
            乙方将设备寄回甲方退换货、维修、申请维修、还机时，需恢复出厂设置，并将设备内部个人资料备份并清除，账号密码、锁屏密码、访问限制密码解除。因设备内信息未清除、账号密码、锁屏密码、访问限制密码未解除造成的损失，由乙方承担。
          </p>
          <p>
            2.2.15
            乙方合约到期归还设备后，乙方需自行拆除设备保护膜与保护壳等配件。甲方不承担壳、膜及相关配件的保管责任。
          </p>
          <p>
            2.2.16
            乙方承诺签订合约时向甲方购买意外维修服务。签收15天后意外维修服务生效，在服务期内若发生碎屏等意外维修服务内的损坏，维修费用累计不超过产品保额上限的，享受免费维修。详见《意外维修服务条款》。
          </p>
          <p>
            2.2.17
            设备类型为手机的订单，在设备签收30天后至标准服务到期前，满足条件的订单可申请换机。若用户申请换机，则需要在申请换机后的25天内归还旧机，并保证旧机符合质检标准。若用户未在规定时间内归还旧机，则将被认为逾期还机，将酌情进行催促或强制买断处理。若用户归还的旧机不符合质检标准，则将收取相应的机器赔偿金。
          </p>
        </>
      ) : (
        <>
          <p>2.2.6 乙方应按照本协议的约定到期向享换机申请续期、归还设备或买断设备。</p>
          <p>2.2.7 当乙方的资信状况及收入状况出现重大不利影响时，乙方应及时通知享换机或其受托人。</p>
          <p>
            2.2.8
            乙方不得以出租、转借或以其他方式将使用服务过程中的相关账户、密码、身份证件信息、手机号码、银行卡信息、住址、邮箱等信息交由任何其他第三方使用，否则由此导致的损失及相关后果由乙方承担。
          </p>
          <p>
            2.2.9
            乙方明确对于享换机进行如下授权：授权享换机及享换机委托的第三方通过合法渠道了解、咨询、审查乙方的身份信息、资信状况、财务状况和其他与评定乙方信用状况及付款能力有关的信息，并可以在享换机提供设备使用服务整个过程中及在追偿违约欠款时索取、留存和使用该信息及乙方在享换机所提供的全部资料；授权享换机接入征信机构共享系统并查询、披露乙方的相关信用信息。
          </p>
          <p>
            2.2.10
            若乙方选择物流人员上门配送设备，则乙方应根据甲方需要，配合工作人员核实设备型号、IMEI号与协议是否一致，全新设备是否已拆封，若签收时未联系客服，则视为包装完好同意签收。若不符合，应当拒收快递，并主动联系客服。
          </p>
          <p>
            2.2.11
            乙方选择的服务中包含非全新设备时，乙方在收件时需确认设备是否有账号密码、锁屏密码、访问限制密码。发现以上情况，需及时联系享换机客服。
          </p>
          <p>2.2.12 乙方归还设备时，经享换机检测认定属如下情况的，乙方应将设备予以买断： </p>
          <p>（1） 因自然灾害、被盗、遗失、人为事故等原因造成机器灭失，无法归还的；</p>
          <p>（2） 机器串码标签缺失、损坏、涂改、字迹模糊而无法确定是否为原机器的；</p>
          <p>（3） 乙方从事非法活动导致机器发生损失的；</p>
          <p>
            （4）
            机器存在毁灭性损坏，设备严重损坏、弯折、机壳分离、内屏损坏、机身内组件（线缆）断裂破损或被强行拆成数块的；
          </p>
          <p>（5） 机器进水、进液的；</p>
          <p>（6） 机器无法正常开机、无法进行系统恢复激活后读取设备序列号或IMEI编号的；</p>
          <p>（7） 机器擅自拆机、改装、维修的；</p>
          <p>（8） 机器型号、S/N号、IMEI号等在进行系统恢复后与合约记载的不符，涂改、缺失或无法辨识的；</p>
          <p>（9） 机器因加装、移除或改动硬件所造成的故障，包括因安装未授权的软件而导致的设备无法正常使用或故障。</p>
          <p>
            2.2.13
            乙方将设备寄回甲方退换货、维修、申请维修、还机时，需恢复出厂设置，并将设备内部个人资料备份并清除，账号密码、锁屏密码、访问限制密码解除。因设备内信息未清除、账号密码、锁屏密码、访问限制密码未解除造成的损失，由乙方承担。
          </p>
          <p>
            2.2.14
            乙方合约到期归还设备后，乙方需自行拆除设备保护膜与保护壳等配件。甲方不承担壳、膜及相关配件的保管责任。
          </p>
          <p>
            2.2.15
            乙方承诺签订合约时向甲方购买意外维修服务。签收15天后意外维修服务生效，在服务期内若发生碎屏等意外维修服务内的损坏，维修费用累计不超过产品保额上限的，享受免费维修。详见《意外维修服务条款》。
          </p>
          <p>
            2.2.16
            设备类型为手机的订单，在设备签收30天后至标准服务到期前，满足条件的订单可申请换机。若用户申请换机，则需要在申请换机后的25天内归还旧机，并保证旧机符合质检标准。若用户未在规定时间内归还旧机，则将被认为逾期还机，将酌情进行催促或强制买断处理。若用户归还的旧机不符合质检标准，则将收取相应的机器赔偿金。
          </p>
        </>
      )}
      <h2>三、售后条款</h2>
      <p>
        3.1
        换货条件：签收后15日内，安卓全新设备未拆封未激活或有非人为因素导致的设备本身质量问题，可以申请换货；苹果全新设备签收后有非人为因素导致的设备本身质量问题，寄回享换机维修。二手设备签收后15日内有不符合《质检标准》且非人为因素导致的功能性问题，符合外观成色标准，可以申请换货。如因乙方人为因素导致二手设备不符合《质检标准》，客户需参照《赔偿规则》进行相应赔偿。
      </p>
      <p>
        3.2
        退货条件：乙方签收后7日内，全新设备在未拆封未激活情况下发现有非人为因素导致的质量问题，且配件未拆封，可以申请退货；二手设备有不符合《质检标准》且非人为因素导致的功能性问题，符合内外观成色标准，可以申请退货。如因乙方人为因素导致二手设备不符合《质检标准》，乙方需参照《赔偿规则》进行相应赔偿。
      </p>
      <table
        style={{
          borderCollapse: 'collapse',
          borderSpacing: '0',
          fontSize: '12px',
          backgroundColor: '#fff',
          textAlign: 'center',
          lineHeight: '30px',
          marginBottom: '15px',
          width: '100%',
        }}
      >
        <thead>
          <tr>
            <th colSpan={5}>质检标准</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td colSpan={5} style={{ backgroundColor: '#f9f9f9' }}>
              1、外观成色标准
            </td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>
              (1)边框背板：有3处以下(不包含3处)划痕或磕碰，且划痕不超过0.5CM，磕碰不超过0.5CM²；机身无弯曲
            </td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(2)屏幕外观：有3处以下(不包含3处)划痕且划痕不超过0.5CM，无缺角、碎裂</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(3)屏幕显示：屏幕主显示区域无坏点、亮斑、色斑、漏液、显示异常，进灰面积1cm²以下</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(4)拆机维修：无私自拆修、IMEI号手机系统、背板、卡槽、商家系统一致。</td>
          </tr>
          <tr>
            <td colSpan={5} style={{ backgroundColor: '#f9f9f9' }}>
              2、功能标准
            </td>
          </tr>
          <tr>
            <td style={{ padding: '0 5px' }}>(1)充电功能正常</td>
            <td style={{ padding: '0 5px' }}>(2)无线功能正常</td>
            <td style={{ padding: '0 5px' }}>(3)正常开机</td>
            <td style={{ padding: '0 5px' }}>(4)账号功能正常</td>
            <td style={{ padding: '0 5px' }}>(5)通话功能正常</td>
          </tr>
          <tr>
            <td style={{ padding: '0 5px' }}>(6)指纹功能正常</td>
            <td style={{ padding: '0 5px' }}>(7)按键功能正常</td>
            <td style={{ padding: '0 5px' }}>(8)指南针正常</td>
            <td style={{ padding: '0 5px' }}>(9)机身无进水</td>
            <td style={{ padding: '0 5px' }}>(10)拍照功能正常</td>
          </tr>
        </tbody>
      </table>
      <p>
        3.3
        维修：乙方签收快递90日内，设备本身功能性问题，全新设备可寄回至甲方售后维修，二手设备寄回由甲方维修；意外因素导致的问题，乙方可以申请维修，具体维修条例详见《意外维修服务条款》，维修时间视设备具体问题而定，维修期间可申请备用机，具体详见本协议第五条备用机条款。乙方私自拆修造成的后果自行承担。
      </p>
      <p>
        3.4
        还机条件：合约到期起至最后还机日，乙方需将设备归还至甲方指定地点。若乙方无法归还至指定地点，需提前告知甲方，选择其他还机方式；逾期未归还，视为乙方选择买断，乙方须一次性支付买断设备的剩余金额，甲方有权从乙方押金预授权金额中优先扣除买断设备的剩余金额，押金预授权金额不足的，由乙方补足。若用户未在规定时间内还机，乙方需要支付给甲方10元违约金外，还需要支付到期设备买断价的0.03%元/天作为逾期费。
      </p>
      <p>还机标准：参照《还机标准》，如有不符合《还机标准》的情况，均视为乙方无法还机，乙方需买断设备。</p>
      <table
        style={{
          borderCollapse: 'collapse',
          borderSpacing: '0',
          fontSize: '12px',
          backgroundColor: '#fff',
          textAlign: 'center',
          marginBottom: '15px',
          width: '100%',
        }}
      >
        <thead>
          <tr>
            <th colSpan={5}>还机标准</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td colSpan={5} style={{ backgroundColor: '#f9f9f9' }}>
              1、外观成色标准
            </td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(1)、边框背板：机身无弯曲，边框无断裂，玻璃背板无碎裂</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(2)、屏幕外观：屏幕无碎裂</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(3)、屏幕显示：屏幕显示无色斑、漏液、错乱、严重老化、无法正常显示等</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(4)、拆修历史：无私自拆修，手机背板、系统、卡槽IMEI一致</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5} style={{ backgroundColor: '#f9f9f9' }}>
              2、功能质检标准
            </td>
          </tr>
          <tr>
            <td style={{ padding: '0 5px' }}>(1)充电功能正常</td>
            <td style={{ padding: '0 5px' }}>(2)无线功能正常</td>
            <td style={{ padding: '0 5px' }}>(3)正常开机</td>
            <td style={{ padding: '0 5px' }}>(4)账号功能正常</td>
            <td style={{ padding: '0 5px' }}>(5)指纹功能正常</td>
          </tr>
          <tr>
            <td style={{ padding: '0 5px' }}>(6)指针功能正常</td>
            <td style={{ padding: '0 5px' }}>(7)拍照摄像功能正常</td>
            <td style={{ padding: '0 5px' }}>(8)机身无进水</td>
            <td style={{ padding: '0 5px' }}>(9)触摸功能正常</td>
            <td style={{ padding: '0 5px' }}>(10)指南针功能正常</td>
          </tr>
        </tbody>
      </table>

      <p>
        3.5
        备用机：乙方申请意外维修服务或维修且获得许可的情况下，可申请备用机，申请备用机须缴纳相应的备用机押金，具体金额在申请时由甲方提供。还机：乙方须在设备维修结束后一周内将备用机寄还甲方，甲方参照《质检标准》对备用机进行质检，若备用机不符合《质检标准》，乙方须参照《赔偿价目表》赔付甲方。
      </p>
      <table
        style={{
          borderCollapse: 'collapse',
          borderSpacing: '0',
          fontSize: '12px',
          backgroundColor: '#fff',
          textAlign: 'center',
          marginBottom: '15px',
          width: '100%',
        }}
      >
        <thead>
          <tr style={{ textAlign: 'center' }}>
            <th colSpan={5}>还机标准</th>
          </tr>
        </thead>
        <tbody>
          <tr style={{ backgroundColor: '#f9f9f9' }}>
            <td>外观</td>
            <td>二手设备</td>
            <td>iOS新机</td>
            <td>安卓新机</td>
          </tr>
          <tr>
            <td>边框背板</td>
            <td>300</td>
            <td>600</td>
            <td>500</td>
          </tr>
          <tr>
            <td>屏幕显示</td>
            <td>500</td>
            <td>1200</td>
            <td>700</td>
          </tr>
          <tr>
            <td>屏幕外观</td>
            <td>300</td>
            <td>600</td>
            <td>400</td>
          </tr>
          <tr>
            <td>私自拆修</td>
            <td>1500</td>
            <td>2500</td>
            <td>1500</td>
          </tr>
          <tr>
            <td>功能</td>
            <td />
            <td />
            <td />
          </tr>
          <tr>
            <td>充电功能</td>
            <td>200</td>
            <td>200</td>
            <td>200</td>
          </tr>
          <tr>
            <td>无线功能</td>
            <td>200</td>
            <td>300</td>
            <td>100</td>
          </tr>
          <tr>
            <td>账号功能</td>
            <td>200</td>
            <td>300</td>
            <td>100</td>
          </tr>
          <tr>
            <td>指纹功能</td>
            <td>300</td>
            <td>400</td>
            <td>300</td>
          </tr>
          <tr>
            <td>按键功能</td>
            <td>200</td>
            <td>300</td>
            <td>300</td>
          </tr>
          <tr>
            <td>指南针功能</td>
            <td>300</td>
            <td>400</td>
            <td>400</td>
          </tr>
          <tr>
            <td>玻璃背板碎裂</td>
            <td>1500</td>
            <td>2500</td>
            <td>2000</td>
          </tr>
          <tr>
            <td>拍照功能</td>
            <td>400</td>
            <td>700</td>
            <td>500</td>
          </tr>
          <tr>
            <td>机身进水</td>
            <td>1500</td>
            <td>2500</td>
            <td>1500</td>
          </tr>
          <tr>
            <td>ID未解除</td>
            <td>全额赔偿</td>
            <td>全额赔偿</td>
            <td>全额赔偿</td>
          </tr>
          <tr>
            <td>无法正常开机</td>
            <td>全额赔偿</td>
            <td>全额赔偿</td>
            <td>全额赔偿</td>
          </tr>
        </tbody>
      </table>
      <p>3.6协议变更</p>
      <p>
        3.6.1
        若由于人为意外因素导致乙方无法正常使用设备，经甲方工程师检测，设备损坏程度在意外维修服务范围内，设备寄送、检测过程中耗费的时间不在原服务期的基础上予以顺延。
      </p>
      <p>3.6.2 若服务期内发生故障，经甲方工程师检测，设备损坏程度超出意外维修服务范围，则设备转为买断。</p>
      <p>
        3.6.3
        设备意外损坏需将设备往返寄送时，需通过顺丰快递进行寄送，快递费遵循“谁寄送谁承担”的原则，同时物流保价费需由乙方承担。顺丰快递在寄送过程中可能会依照国家相关规定进行拆包验视，如果到件新机已拆封未激活，也视为符合销售标准，不予退换。
      </p>
      <h2>四、违约条款 </h2>
      <p>
        4.1 当事人一方不履行合同义务或者履行合同义务不符合约定的，应当承担继续履行、采取补救措施或者赔偿损失等违约责任。
      </p>
      <p>
        4.2
        甲方有权根据相关适用法律，将在服务关系建立和存续期间获得的乙方个人基本信息、债务信息、信用信息（即适用法律规定的对乙方信用状况的客观状态）等有关信息，在乙方逾期支付服务费、买断价格或归还设备的，甲方有权按照日万分之五的标准向乙方收取逾期违约金。逾期超过30天的情况下，甲方有权单方面解除合同，并将相关信用信息反馈给司法部门、征信管理机构、行业监督管理机构等以督促乙方履行义务。
      </p>
      <p>
        4.3
        乙方在此不可撤销地同意并授权：在乙方逾期时，享换机有权直接从乙方与账户绑定的银行卡或信用卡中直接扣减使用服务应支付的全部款项（含逾期管理费、滞纳金、调查费、律师费等所有费用）；享换机有权采取其他相关救济措施进行追讨，包括使用或授权第三方查询、索取、留存和使用乙方的资信状况、财务状况、其他与评定乙方信用状况及付款能力有关的个人信息等方式进行违约救济；享换机有权使用或授权第三方催收公司使用乙方个人信息对违约欠款进行追偿，为此目的向第三方提供乙方的个人信息不视为甲方违反保密义务。
      </p>
      {payType === 1 && (
        <>
          <p>
            4.4
            乙方在签署本协议的前提下，在服务期限内申请提前解除合同或买断设备的行为视为违约，乙方应当根据以下规则承担违约责任：
          </p>
          <p>
            （1）
            提前解约：乙方在服务期限内提前解除合同，并向甲方归还设备的，乙方应向甲方足额缴齐剩余期限内的全部服务费。
          </p>
          <p>（2） 提前买断设备：乙方在服务期限内提前买断设备，乙方应向甲方全额支付剩余期间服务费、及到期买断费用。</p>
          <p>
            4.5 双方因本合同引起的或与本合同有关的争议，均同意提请中国广州仲裁委员会,
            按照申请仲裁时该会现行有效的网络仲裁规则进行网络仲裁。仲裁裁决是终局的，对双方均有约束力。
          </p>
          <p>
            （1）送达条款：甲方/乙方确认以<span className={styles.fill}>{userInfo.get('user_email')}</span>为联络邮箱，为双方之间及涉诉纠纷相关材料送达地址；并以<span
              className={styles.fill}
            >
              {userInfo.get('user_phone')}
            </span>为联络手机号码，为短信通知号码。按本合同约定由任何一方发给其他方的任何通知，应以电子邮件或者短信等形式发出，送至约定邮箱或者手机号码。收件人指定系统接受材料或通知之日，即视为送达和收到之日。如一方需变更联络邮箱或者手机号码的，应当书面通知并得到对方确认。
          </p>
          <p>
            4.6
            乙方承诺，不会对外散布有损甲方利益的任何不良言论。因乙方违反该规定，对甲方声誉、品牌或形象造成严重损害后果的，甲方将通过法律手段追究乙方的民事责任，情节严重的，甲方有权向公安机关报案。
          </p>
        </>
      )}
      {payType !== 1 && (
        <>
          <p>
            4.4
            乙方承诺按照服务费支付安排按时及时足额包括不限于银行卡代扣的方式向甲方缴付服务费。拖期超过90天，视作乙方违约。甲方有权按照本协议提前终止服务，扣除乙方全部押金预授权金额。
          </p>
          <p>
            4.5
            乙方在签署本协议的前提下，在服务期限内申请提前解除合同或买断设备的行为视为违约，乙方应当根据以下规则承担违约责任：
          </p>
          <p>
            <b>
              （1）
              提前解约：乙方在服务期限内提前解除合同，并向甲方归还设备的，乙方应向甲方足额缴齐剩余期限内的全部服务费。
            </b>
          </p>
          <p>
            <b>
              （2） 提前买断设备：乙方在服务期限内提前买断设备，乙方应向甲方全额支付剩余期间服务费、及到期买断费用。
            </b>
          </p>
          <p>
            4.6 双方因本合同引起的或与本合同有关的争议，均同意提请中国广州仲裁委员会,
            按照申请仲裁时该会现行有效的网络仲裁规则进行网络仲裁。仲裁裁决是终局的，对双方均有约束力。
          </p>
          <p>
            （1）送达条款：甲方/乙方确认以<span className={styles.fill}>{userInfo.get('user_email')}</span>为联络邮箱，为双方之间及涉诉纠纷相关材料送达地址；并以<span
              className={styles.fill}
            >
              {userInfo.get('user_phone')}
            </span>为联络手机号码，为短信通知号码。按本合同约定由任何一方发给其他方的任何通知，应以电子邮件或者短信等形式发出，送至约定邮箱或者手机号码。收件人指定系统接受材料或通知之日，即视为送达和收到之日。如一方需变更联络邮箱或者手机号码的，应当书面通知并得到对方确认。
          </p>
          <p>
            4.7
            乙方承诺，不会对外散布有损甲方利益的任何不良言论。因乙方违反该规定，对甲方声誉、品牌或形象造成严重损害后果的，甲方将通过法律手段追究乙方的民事责任，情节严重的，甲方有权向公安机关报案。
          </p>
        </>
      )}

      <h2>五、争议解决</h2>
      <p>
        协议履行中发生争议，可由各方协商解决。协商不成的，各方有权向上海仲裁委员会提请仲裁申请，最终仲裁结果对双方均有约束力。
      </p>
      <h2>六、免责条款</h2>
      <p>
        本协议有效期内，因国家相关主管部门颁布、变更的法律法规、政策导致享换机不能提供约定服务的，不视为其违约，各方可根据相关的法律法规、政策变更协议内容或提前终止本协议。
      </p>
      <h2>七、法律适用和争议的解决</h2>
      <p>本协议受中华人民共和国法律管辖并按中华人民共和国法律解释。</p>
      <br />
      <p>甲 方：晋松（上海）网络信息技术有限公司 </p>
      <p>
        乙方：<span className={styles.fill}>{userInfo.get('user_name')}</span>
        <label style={{ color: '#fff' }}>{agreement.get('user_code')}</label>
      </p>
      <p>
        日期：<span className={styles.fill}>{agreement.get('year')}</span>年<span className={styles.fill}>
          {agreement.get('month')}
        </span>月<span className={styles.fill}>{agreement.get('day')}</span>日
      </p>
    </div>
  )
}

export default OrderContract
