import { GetInitialPropsContext } from '@@types/next'
import { checkLogin } from 'actions/app'
import { getLbfAgreement } from 'actions/myAccount/termsList'
import { Container, Header, TabBar } from 'components'
import { ErrorObject } from 'interfaces/error'
import * as React from 'react'
import { connect } from 'react-redux'
import styles from '../../../Terms/common.less'

export interface CreditcardProps extends ErrorObject {
  lbfterm: any
}

export interface CreditcardState {}

class Creditcard extends React.Component<CreditcardProps, CreditcardState> {
  static async getInitialProps({ store, isServer, query, res, asPath, req }: GetInitialPropsContext) {
    const isLogin = await store.dispatch(checkLogin({ isServer, res, asPath }))
    if (isLogin) {
      const data = await store.dispatch(getLbfAgreement({ query, req }))
      if (data.status) {
        return { error: data }
      }
    }
  }
  render() {
    // 乐百分服务条款
    const containerProps = {
      renderHeader: <Header>授信额度担保授权合同</Header>,
      renderTabBar: <TabBar hidden={true} />,
      className: styles.container,
    }
    const { lbfterm } = this.props
    return (
      <Container {...containerProps}>
        <p>
          合同编号：<span className={styles.fill}>{lbfterm.getIn(['trade_info', 'channel_trade_no'])}</span>
        </p>
        <p>
          订单编号：<span className={styles.fill}>{lbfterm.get('trade_no')}</span>
        </p>
        <p>
          商户（以下简称甲方）：<span className={styles.fill}>上海银骏科技有限公司</span>
        </p>
        <br />
        <p>业务申请人（以下简称乙方）</p>
        <p>
          身份证号：<span className={styles.fill}>{lbfterm.getIn(['user_info', 'user_id_card'])}</span>
        </p>
        <p>
          联系电话：<span className={styles.fill}>{lbfterm.getIn(['user_info', 'user_phone'])}</span>
        </p>
        <br />
        <p>
          合作商户：<span className={styles.fill}>晋松（上海）网络信息技术有限公司（或简称“享换机”）</span>
        </p>
        <p>
          商品种类：<span className={styles.fill}>3C产品</span>
        </p>
        <br />
        <p>授权要素</p>
        <p>
          授信额度总额：<span className={styles.fill}>{lbfterm.getIn(['trade_info', 'deposit_total_price'])}</span>
        </p>
        <p>
          冻结期限：<span className={styles.fill}>{lbfterm.getIn(['trade_info', 'lease_term_periods'])}</span>
        </p>
        <p className={styles.statement}>
          特别声明：请乙方务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、争议解决和法律适用条款，这些免除或者限制责任的条款可能以加粗字体显示，乙方应重点阅读。除非乙方已阅读并接受本合同和所有条款，否则乙方无权申请租赁担保业务。乙方申请租赁担保业务即视为乙方已阅读并同意本合同的约束。
        </p>
        <p>
          乙方自愿申请使用甲方所提供的信用卡个人租赁担保业务，用于担保租赁或租赁转购买合作商户的商品/服务（下简称“商品”）一事，双方本着平等、自愿的原则，经协商一致，达成如下条款：
        </p>
        <h2>第一条 定义</h2>
        <p>
          1、租赁担保业务：指甲方在严谨的用户审核基础上，通过网络平台、移动终端设备及借助银联网络实现乙方以其本人持有的银联信用卡授信额度冻结作为向合作商户履约担保的业务。
        </p>
        <p>
          2、授信额度总额：为乙方与合作商户约定的手机租赁担保费用，合同中的“授信额度总额”与乙方在合作商户平台界面显示的“押金”金额应一致。如金额不一致，则以本合同约定的金额为准。
        </p>
        <p>3、冻结期限：</p>
        <p>
          （1）是指乙方在合作商户申请租赁商品，并经甲方系统成功冻结指定信用卡授信额度之日起至乙方与合作商户租赁关系结束之日。合同的“冻结期限”与乙方在合作商户享受租赁服务的“租期”应一致，如不一致的，则以本合同约定的为准。
        </p>
        <p>
          <b>
            （2）特别提示：租赁担保业务的授信额度冻结周期为25个自然日。自乙方成功办理租赁担保业务之日起，每逢第26个自然日称为“指定冻结日”。
          </b>
        </p>
        <p>4、担保用途：仅限用于乙方个人向甲方的合作商户租赁或租赁转购买商品。</p>
        <h2>第二条 租赁商品的申请与购买</h2>
        <p>
          1、乙方从合作商户处租赁商品，并自愿选择使用租赁担保业务完成租赁手续，手续完成后，由合作商户负责向乙方交货。
        </p>
        <p>
          2、乙方向合作商户租赁商品时，阅读并同意本授权合同，核对合作商户平台界面显示的“授信额度总额”、“租赁期”等无误后，提交租赁担保业务申请。（1）甲方收到乙方的申请后，根据合作商户提交的“授信额度总额”等数据使用乙方指定的信用卡账户的授信额度作为付款担保；（2）授信额度担保审核过程中，甲方将从乙方信用卡账户对授信额度总额进行授信额度冻结担保；（3）冻结授信额度总额成功，则租赁担保业务申请完成。甲方向乙方发送租赁担保业务申请成功的短信通知。
        </p>
        <p>
          3、乙方通过租赁担保业务取得商品在租赁期（即X期X个自然日）内的使用权，并应按乙方与合作商户签订的《享换机服务协议》的约定，在租赁期到期日前（含到期日）将商品归还合作商户。
        </p>
        <p>4、若乙方未按时向合作商户支付租金，则根据乙方与合作商户签订的《享换机服务协议》，乙方由租赁转为购买商品。</p>
        <p>
          5、若乙方未在租赁期到期日前（含到期日）归还租赁商品，则根据乙方与合作商户签订的《享换机服务协议》，乙方由租赁转为购买商品。
        </p>
        <p>
          6、若乙方在归还商品时经合作商户检测该商品设备损坏程度超过免赔范围（如有）且乙方拒绝支付相应赔偿金，则根据乙方与合作商户签订的《享换机服务协议》，乙方由租赁转为购买商品。
        </p>
        <p>
          7、乙方不可撤销地同意并授权：若乙方出现本条第5款、第6款或《享换机服务协议》中约定的其他由租赁转为购买情形的，则乙方同意，甲方有权一次性扣划授信额度总额。
        </p>
        <h2>第三条 租赁商品的后续付款</h2>
        <p>1、每期租金根据《享换机服务协议》，由合作商户自行向乙方收取，与甲方无关。</p>
        <p>
          2、乙方不可撤销地同意并授权：(1)在每期指定冻结日，由甲方撤销此前的额度担保，并重新冻结授信额度总额，直至冻结期限到期。或当出现本合同第二条第5款、第6款或《享换机服务协议》中约定的其他由租赁转为购买情形时，由甲方一次性扣划授信额度总额。(2)
          若通过上述方式无法划扣，则甲方有权通过其他方式要求乙方偿还租赁转购买款项。
        </p>
        <p>
          3、乙方须保证在每期指定冻结日或之前，其信用卡账户处于正常使用状态。乙方保证所提供的信用卡账户真实有效，并承担因账户错误、虚假、过期等原因所引起的一切责任和后果。如乙方信用卡账户发生包括但不限于上述异常情况，乙方应及时在甲方微信公众号（微信号：fundshare）完成信用卡账户变更申请或致电租赁担保业务热线（4008844833）协商缴足相关款项。若因此造成后续冻结延误或无法对全部授信额度总额进行授信额度冻结，乙方同意由租赁转为购买商品，并自愿承担由甲方一次性划扣授信额度总额或更换乙方名下其他信用卡冻结相应授信额度，并按每日0.05%的比例收取违约金等处理方式，且同意甲方定期或不定期对其授信额度总额进行一次性或多次性授信额度冻结，直至授信额度总额全部冻结成功。
        </p>
        <p>
          4、乙方不可撤销地同意并授权：甲方有权根据法律法规、信用政策、支付通道和资金安全的需要，采取不同的授信额度转消费和冻结方式。
        </p>
        <h2>第四条 租后、售后保障及商品归还：</h2>
        <p>1、所有商品信息均来自于甲方的合作商户，其真实性、准确性和合法性由合作商户负责。</p>
        <p>
          2、甲方向乙方提供租赁担保业务，使乙方可以使用租赁担保业务来担保租赁或租赁转购买商品，商品的质量由合作商户保证并提供相关售后服务。
        </p>
        <p>
          3、乙方同意：如乙方未能与合作商户就商品服务纠纷达成共识（包括但不限于商品质量的问题），乙方不得以与合作商户之间的商品服务纠纷或其他纠纷为由拒绝向甲方履行本协议约定的条款，否则甲方有权向乙方一次性收取授信额度总额。
        </p>
        <p>4、退货退款流程，乙方不可撤销地同意并授权</p>
        <p>
          （1）向合作商户租赁商品时，有关商品租后、售后服务条款以合作商户的《享换机服务协议》规定为准。若乙方申请退款退货，应与合作商户协商，协商一致后，由合作商户向甲方系统提交退款申请。
        </p>
        <p>（2）甲方收到退款申请后，通过甲方系统将本次交易判定为“撤销”，并撤销乙方信用卡账户的授信额度担保</p>
        <p>5、商品归还流程，乙方不可撤销地同意并授权：</p>
        <p>
          （1）乙方需在商品租赁期到期日前（包含到期日）归还商品至合作商户。乙方与合作商户完成商品归还手续后，甲方根据合作商户向甲方系统发送的指令，全额划扣、部分划扣或撤销乙方信用卡账户的授信额度担保。
        </p>
        <p>
          （2）如乙方未在租赁期到期日前（包含到期日）归还租赁商品，则根据乙方与合作商户签订的《享换机服务协议》，乙方由租赁转为购买商品，甲方有权一次性划扣授信额度总额。
        </p>
        <p>
          （3）商品的归还验收标准由合作商户设定并检验，如商品的损坏程度超过合作商户设定的免赔范围（如有），则根据乙方与合作商户签订的《享换机服务协议》，甲方有权根据合作商户向甲方系统发送的指令，在乙方信用卡账户的授信额度担保中划扣应付赔偿金；乙方不得以与合作商户之间的商品验收纠纷为由拒绝向甲方履行付款义务。
        </p>
        <p>
          （4）如乙方主动要求提前归还商品，并与合作商户协商达成一致，且完成相应商品验收处理、费用结算流程后，本合同提前终止，甲方根据合作商户向甲方系统发送的指令，划扣相应款项并撤销乙方信用卡账户的授信额度担保。
        </p>
        <h2>第五条 乙方的声明、保证、承诺和相关义务：</h2>
        <p>1、乙方在合同期间无条件地配合甲方及合作商户对其资信状况、信用卡还款情况等进行监督检查。</p>
        <p>
          2、乙方个人资产、经济状况等发生实质性变化或发生任何影响本合同义务履行的事项，应立即书面通知甲方及合作商户。乙方参与可能影响其履行本合同项下义务的活动之前应经甲方及合作商户的书面同意。
        </p>
        <p>
          3、乙方不可撤销地同意并授权甲方及合作商户在履行本合同过程中，为本合同之目的不定时地查询和使用任何合法设立的信息库有关乙方的全部信息。如本人违反本合同的有关约定，本人同意甲方及合作商户向中国人民银行个人信用信息基础数据库等有关征信机构及其他任何第三方报送本人的个人信息和不良信用信息，且不再另行告知本人。
        </p>
        <p>
          4、若乙方发生违约，乙方同意甲方及合作商户聘请的任何第三方有权以合法的方式向乙方发出提示及追索，乙方不得提出任何异议或提出任何诉讼。
        </p>
        <p>
          5、乙方承诺按本合同约定的用途使用租赁担保业务，与乙方享有的商品或服务质量和租后、售后权益属于完全不同的法律关系，因此放弃以在使用过程中产生的质量和租后、售后权益纠纷（包括但不限于质量及租后、售后服务纠纷）或其他纠纷为由拒绝履行本合同。乙方租赁或购买的商品或服务质量由合作商户保证，并提供租后、售后服务。
        </p>
        <p>
          6、合同期限内，乙方不得要求动用该授信额度款项以偿还任何其他费用。但如果甲方及合作商户依据本合同第六条要求乙方履行义务并向乙方追偿所有债务时，甲方及合作商户有权直接划扣乙方信用卡账户用于担保的授信额度，用以抵扣乙方所欠的所有款项。
        </p>
        <p>7、乙方向甲方及合作商户声明并保证如下：</p>
        <p>（1）乙方提供的所有信息完整、准确、真实并无误导性；</p>
        <p>（2）本合同的签订和履行未构成乙方作为协议一方的或受约束的任何合同、协议、保证或承诺下的违约行为；</p>
        <p>（3）乙方签订和履行本合同不违反任何法律、法规、条例或任何法庭、仲裁机关或行政机关的命令、判决或裁决；</p>
        <p>
          （4）乙方未以任何形式涉及任何未决的、进行中的或有危险发生的法律行动、索赔、起诉、仲裁或行政程序等可能影响本合同履行的事件。
        </p>
        <p>
          8、乙方承诺按指定用于担保的信用卡开户行的指定期限和标准偿还应付款项，保证信用卡在租赁期内为正常使用状态，有足够可用授信额度供甲方对授信额度总额进行授信额度冻结，否则甲方有权向乙方一次性收取授信额度总额或更换乙方名下其他信用卡划扣应付款项，并按每日0.05%的比例收取违约金，且可定期、不定期对授信额度总额进行授信额度冻结，直至授信额度总额全部划扣成功。
        </p>
        <p>
          <b>
            9、乙方同意：乙方通过在银行办理信用卡时预留的手机号码获取短信验证码，在业务界面输入并通过短信验证步骤，则视为乙方本人操作。因乙方的过错导致的任何损失由乙方自行承担，该过错包括但不限于：不按照交易提示操作，未能及时进行交易操作，遗忘与合作商户进行消费验证或泄露短信验证码，手机或账号被盗、被他人使用等。
          </b>
        </p>
        <h2>第六条 违约责任：</h2>
        <p>
          1、乙方发生以下情况，属于严重违约：①、乙方使用虚假身份证明文件；②、乙方提供的信用卡账户，经查核已被银行信用系统列入黑名单或被依法冻结；③、其账户内没有足够可用授信额度供甲方冻结授信额度总额；④、乙方在与甲方签订的任何其他合同中有严重违约行为；⑤、乙方作出的任何陈述或保证虚假、不完整、不准确或有歧义，或乙方违背第五条所作出的任何保证、承诺或同意；⑥、甲方或合作商户有证据证明乙方就租赁担保业务从事过任何欺诈行为或乙方可能无能力履行本合同项下的信用卡还款义务；⑦、乙方发生或可能发生影响甲方或合作商户在本合同项下权益的任何其他情形。
        </p>
        <p className={styles.indent}>
          乙方发生以上违约情形，将直接导致本合同提前终止，甲方及合作商户有权要求乙方立即偿还本合同下全部剩余款项。乙方应立即偿还本合同下全部剩余应付款项。若乙方未履行该义务，甲方或合作商户有权宣布本合同提前到期，要求乙方立即一次性履行本合同项下全部义务。
        </p>
        <p>
          2、若乙方的信用卡账户未能如期成功冻结授信额度总额，或划扣租赁转购买后的授信额度总额，甲方及合作商户有权保留追究的权利。
        </p>
        <p>
          3、甲方或合作商户为执行本合同、实现合同权益所支出的所有费用（包括但不限于律师费和交通、食宿、诉讼费、评估、鉴定、登记、公证、公告、保险、保管、运输等费用）均由乙方承担。
        </p>
        <p>
          4、如因乙方原因发生包括但不限于第三条第3款之情形，而导致甲方或合作商户无法执行授信额度冻结操作时，甲方或合作商户有权采取向乙方一次性收取授信额度总额，或更换乙方名下其他信用卡划扣应付款项，并按每日0.05%的比例收取违约金，且可定期或不定期对其授信额度总额进行冻结等处理方式，直至授信额度总额全部冻结成功或划扣成功。
        </p>
        <h2>第七条清偿顺序：</h2>
        <p>1、乙方在不同时期与甲方签订多份合同，清偿顺序按签订时间确定。</p>
        <h2>第八条争议解决方式：</h2>
        <p>
          1、本合同的订立、解释及争议的解决均适用中华人民共和国的法律、法规。本合同履行所发生的纠纷，双方应协商解决，协商不成的任何一方均可向本合同签订地广州市天河区人民法院提请诉讼。
        </p>
        <p>2、各方在协商、诉讼期间，对本合同项下不涉及争议的条款，仍须执行。</p>
        <h2>第九条其他约定：</h2>
        <p>
          1、本合同下乙方任何付款行为应被认定在指定信用卡账户贷记入相应款项时发生。该时间根据相关银行向甲方提供的交易记录确定。
        </p>
        <p>2、乙方同意，当乙方信用卡变更或状态异常时，甲方及合作商户有权要求乙方一次性偿还本合同下全部剩余应付款项。</p>
        <p>
          3、在合作商户线下实体店租赁时，乙方持有合作商户的租赁凭证和乙方本人的真实身份证为本合同不可分割的有效组成部分，均需妥善保管；在合作商户网上商城租赁时，乙方本人的真实身份证和商品物流签收单为本合同不可分割的有效组成部分，均需妥善保管。
        </p>
        <p>
          4、为保障乙方权益，乙方联系电话号码等个人信息发生变动后应于5个自然日内在租赁担保业务界面修改资料并提交给甲方或致电服务热线。若乙方未及时通知，甲方仍按乙方所留电话或地址寄发相关信息或信件的，均视为有效送达，由此产生的一切后果由乙方承担。
        </p>
        <p>
          5、若本合同的任何条款被任何司法或有权机关认定为无效或不可强制执行，该条款将被从本合同中分离出来，其余条款仍应有效。
        </p>
        <p>
          6、乙方同意，若相关法律法规和信用政策发生变化，则甲方无需提前发出书面通知，也无需得到乙方的许可，甲方即有权按新的法律法规和信用政策规定处理本合同的相关事务。
        </p>
        <p>7、乙方同意，本合同所涉及的乙方个人资料公开给甲方和合作商户，以用于管理业务及会员信息库等方面的用途。</p>
        <p>
          8、本合同采用电子文本形式，各方均认可该形式合同的法律效力。自乙方勾选“本人已全部详细阅读以上《授信额度担保授权合同》并同意全部条款”，且成功办理租赁担保业务之日起生效。
        </p>
        <br />
        <p>本人已全部详细阅读以上《授信额度担保授权合同》并同意全部条款</p>
        <p>
          本合同于<span className={styles.fill}>{lbfterm.get('year')}</span>年<span className={styles.fill}>
            {lbfterm.get('month')}
          </span>月<span className={styles.fill}>{lbfterm.get('day')}</span>日签订
        </p>
      </Container>
    )
  }
}
const mapStateToProps = (state: any) => ({
  lbfterm: state.getIn(['myAccount', 'termsList', 'lbfterm']),
})
export default connect(mapStateToProps)(Creditcard)
