import React from 'react'
import PropTypes from 'prop-types'
import classnames from 'classnames'
import styles from './Terms.less'

const Terms = ({ formStatus }) => {
  return (
    <div className={classnames(styles.terms_box, formStatus === 3 && styles.active)}>
      <div className="service-container">
        <p className="title">
          特别声明：请乙方务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、争议解决和法律适用条款，这些免除或者限制责任的条款可能以加粗字体显示，乙方应重点阅读。除非乙方已阅读并接受本合同和所有条款，否则乙方无权申请使用“乐百分”业务。乙方使用“乐百分”业务即视为乙方已阅读并同意本合同的约束。
        </p>
        <p>
          乙方自愿申请使用甲方所提供的信用卡个人消费分期支付业务（以下简称“乐百分”业务），用于分期支付租赁或租赁转购买爱回收的商品/服务（下简称“商品”）一事，双方本着平等、自愿的原则，经协商一致，达成如下条款：
        </p>
        <p className="title">第一条 定义</p>
        <p>
          1、“乐百分”个人消费分期支付业务：指乙方通过网络平台、移动终端设备实现信用卡持卡人分期支付消费，并为分期支付消费提供支付平台服务的业务（以下简称为“乐百分”业务）
        </p>
        <p>
          2、分期租赁总金额：为乙方与爱回收约定的手机租赁费用，合同中的
          “分期租赁总金额”与乙方在爱回收平台界面显示的金额应一致。如金额不一致，则以本合同约定的金额为准。
        </p>
        <p>3、分期租赁余额：分期租赁总金额扣除租赁期间已支付的每期租赁金额后的剩余未支付金额。</p>
        <p>4、租赁手续费：乙方为使用本分期租赁业务所需付出的，扣除租赁机价、保险费以外的部分。</p>
        <p>
          5、分期租赁期限：（1）合同的“分期租赁期数”与乙方在爱回收平台界面选择分期期数应一致，如分期期数显示不一致，则以本合同约定的期数为准。
          <span>（2）特别提示：“乐百分”业务每期计算周期为25个自然日。</span>
        </p>
        <p>6、分期支付用途：仅限用于乙方个人向爱回收租赁或租赁转购买爱回收的商品。</p>
        <p className="title">第二条 分期租赁或租赁转购商品：</p>
        <p>1、 甲方与爱回收联合租赁商品，乙方从爱回收处租赁商品，并自愿选择使用“乐百分”业务完成租赁手续。</p>
        <p>
          2、
          乙方向爱回收租赁商品时，阅读并同意本分期租赁合同，核对爱回收界面显示的“分期租赁总金额”、“分期租赁期数”和“每期租赁金额”无误后，提交“乐百分”业务申请。（1）甲方收到乙方的申请后，根据其提交的“分期租赁总金额”使用乙方指定用于分期支付的信用卡账户的授信额度作为租赁还款担保；（2）授信额度担保审核过程中，甲方将从乙方信用卡账户划扣第一期租赁金额，对分期租赁总金额扣除一期租赁金额后的剩余金额进行授信额度冻结担保；（3）划扣第一期及冻结剩余租赁金额成功，则“乐百分”业务分期申请完成。甲方向乙方发送分期申请成功的短信通知。
        </p>
        <p>
          3、
          在“乐百分”业务申请成功后，爱回收安排发货或乙方到爱回收实体店取货，商品给付乙方后“乐百分”业务分期消费完成，开始计算乙方租赁日期。
        </p>
        <p>
          4、
          乙方通过“乐百分”业务取得商品在租赁期（375个自然日）内的使用权，并应按乙方与爱回收签订的《爱回收合同》，在租赁期到期日前（含到期日）按约定将商品归还爱回收。
        </p>
        <p>
          5、
          若乙方未在租赁期到期日前（含到期日）归还租赁商品，则根据乙方与爱回收签订的《爱回收合同》，乙方由租赁转为购买爱回收商品。
        </p>
        <p>
          6、
          若乙方在归还商品时经爱回收工程师检测该商品设备损坏程度超过免赔范围且乙方拒绝支付相应赔偿金，则根据乙方与爱回收签订的《爱回收合同》，乙方由租赁转为购买爱回收商品。
        </p>
        <p>
          <span>
            7、
            若乙方出现本条第6或第7款情形，则乙方同意，甲方有权一次性扣划分期租赁余额，即乙方信用卡账户的授信额度担保余额一次性转消费。
          </span>
        </p>
        <p className="title">第三条 后续分期支付：</p>
        <p>1、 乙方委托甲方指定的代扣机构将分期租赁应支付的款项从指定用于分期支付的信用卡账户划至甲方指定的账户。</p>
        <p>
          2、
          分期租赁或租赁转购买款项收取方式：乙方同意，(1)在每期指定支付日，由甲方将当期应付租赁款计入乙方当期信用卡消费，并撤销此前的额度担保，并将剩余租赁金额再行通过授信额度进行担保，直至租用期到期。或当出现本合同第二条第6或第7条由租赁转为购买情形时，由甲方一次性扣划分期租赁余额。(2)
          若通过上述方式无法偿还，则甲方有权通过其他方式要求乙方偿还当期分期租赁金额或租赁转购买款项。
        </p>
        <p>3、 分期支付以分为最小单位，剩余各期按“每期租赁金额”支付分期款项。</p>
        <p>
          4、
          乙方须在每期指定支付日或之前，将到期应付款项足额划入信用卡账户，保证在每个指定支付日其信用卡账户内有足够可用授信额度供甲方划扣当期应付款及对分期租赁余额进行授信额度冻结。乙方保证所提供的信用卡还款账户真实有效，并承担因账户错误、虚假、过期、被冻结、被挂失或可用授信额不足以划扣当期应付款、无法对分期租赁余额进行授信额度冻结等原因所引起的一切责任和后果。如还款账户发生包括但不限于资料变更、被冻结、被挂失或可用授信额不足以划扣当期应付款、无法对分期租赁余额进行授信额度冻结等情况，乙方应及时在“乐百分”微信公众号（微信号：fundshare）完成还款账户变更申请或致电“乐百分”业务热线协商缴足相关款项。
          <span>
            若因此造成后续扣款延误或不成功，乙方同意由租赁转为购买爱回收商品，并自愿承担由甲方一次性划扣分期租赁余额（即乙方信用卡账户的授信额度担保余额一次性转消费）或收取违约金（每日0.05%）或更换乙方名下其他信用卡划扣应支付款项等处理方式，并同意甲方定期或不定期对其剩余分期金额进行一次性或多次性授信额度冻结，直至分期支付余额全部冻结成功。
          </span>
        </p>
        <p>5、 乙方同意，甲方有权根据支付安全的需要，采取不同的授信额度转消费和冻结方式。</p>
        <p className="title">第四条 租后、售后保障及商品归还：</p>
        <p>1、所有商品信息均来自于甲方的特约商户“爱回收”，其真实性、准确性和合法性由爱回收负责</p>
        <p>
          2、甲方向乙方提供分期支付服务，使乙方可以使用“乐百分”业务租赁或租赁转购买商品，商品的质量由爱回收保证并提供相关售后服务。
        </p>
        <p>
          <span>
            3、乙方同意，如乙方未能与爱回收就商品服务纠纷达成共识（包括但不限于商品质量的问题），乙方不得以与爱回收之间的商品服务纠纷为由拒绝向甲方履行分期付款责任，否则甲方有权向乙方一次性收取分期租赁余额。
          </span>
        </p>
        <p>4、退货退款流程，乙方同意： </p>
        <p className="level-b">
          1）
          向爱回收租赁商品时，有关商品租后、售后服务条款以爱回收规定为准。若乙方申请退款退货，应与爱回收协商，协商一致后，由爱回收向甲方“乐百分”系统提交退款申请。
        </p>
        <p className="level-b">
          2）
          甲方收到申请后，通过“乐百分”系统将本次交易判定为“撤销”，把已付款项沿原途径退回到乙方的信用卡账户（到账时间视信用卡发卡行不同而有所差异），并撤销信用卡账户的授信额度担保。
        </p>
        <p>5、商品归还流程，乙方同意：</p>
        <p className="level-b">
          1)
          乙方需在商品租赁期到期日前（包含到期日）归还商品至爱回收。乙方与爱回收完成商品归还手续后，甲方撤销乙方信用卡账户的分期租赁余额授信额度担保。
        </p>
        <p className="level-b">
          2)
          如乙方未在租赁期到期日前（包含到期日）归还租赁商品，则根据乙方与爱回收签订的《爱回收合同》，乙方由租赁转为购买爱回收商品，甲方有权一次性划扣分期租赁余额（乙方信用卡账户的授信额度担保余额一次性转消费）。
        </p>
        <p className="level-b">
          3)
          商品的归还验收标准由爱回收设定并检验，如商品的损坏程度超过爱回收设定的免赔范围，且乙方拒绝支付相应赔偿金，则根据乙方与爱回收签订的《爱回收合同》，乙方由租赁转为购买爱回收商品，甲方有权一次性划扣分期租赁余额；乙方不得以与爱回收之间的商品验收纠纷为由拒绝向甲方履行分期付款义务。
        </p>
        <p className="level-b">
          4)
          如乙方主动要求提前归还商品，并与爱回收协商达成一致，且完成相应商品验收处理、费用结算流程后，本分期支付合同提前终止，甲方撤销乙方信用卡账户的分期租赁余额授信额度担保。
        </p>
        <p className="title">第五条 乙方的声明、保证、承诺和相关义务：</p>
        <p>
          1、乙方在合同期间无条件地配合甲方及本合同项下甲方债权受让的第三方（以下简称“债权受让方”）对其资信状况、分期支付使用情况以及偿还分期支付情况进行监督检查。
        </p>
        <p>
          2、乙方个人资产、经济状况等发生实质性变化或发生任何影响本合同义务履行的事项，应立即书面通知甲方及债权受让方。乙方参与可能影响其履行本合同项下义务的活动之前应经甲方及债权受让方的书面同意。
        </p>
        <p>
          <span>
            3、乙方同意并授权甲方及债权受让方在履行本合同过程中，为本合同之目的查询和使用任何合法设立的信息库有关乙方的全部信息，并授权指定甲方及债权受让方不定时地向中国人民银行个人信用信息基础数据库等有关征信机构及其他任何第三方查询、获取、保留、提供其个人信息和信用信息。
          </span>
        </p>
        <p>
          <span>
            4、若乙方发生违约，乙方同意甲方及债权受让方聘请的任何第三方有权以合法的方式向乙方发出提示及追索，乙方不得提出任何异议或提出任何诉讼。
          </span>
        </p>
        <p>
          <span>
            5、乙方承诺按本合同约定的用途进行分期租赁甲方提供的商品或服务，与乙方享有的商品或服务质量和租后、售后权益属于完全不同的法律关系，因此放弃以在使用过程中产生的质量和租后、售后权益纠纷（包括但不限于质量及租后、售后服务纠纷）为由拒绝履行本合同。乙方租赁或购买的商品或服务质量由爱回收保证，并提供租后、售后服务。
          </span>
        </p>
        <p>
          6、合同期限内乙方违约，乙方不得要求动用该授信额度款项以支付其他各期分期租赁或任何其他费用。但如果甲方及债权受让方依据本合同第六条第2款要求乙方履行分期支付义务并向乙方追偿所有债务时，甲方及债权受让方有权通知代扣机构直接划扣乙方信用卡账户用于担保的授信额度，用以抵扣乙方所欠的所有款项。
        </p>
        <p>
          7、乙方同意：如甲方转让本合同下的债权，乙方将继续按照本合同第二条第2、第7款及第三条第4款约定的支付方式，向新的债权受让方履行本合同下的所有义务。乙方承诺不因该债权转让提出任何异议，同时放弃以与爱回收之间的租赁或买卖纠纷为由拒绝向债权受让方履行付款义务。
        </p>
        <p>
          8、乙方向甲方及债权受让方声明并保证如下：1）乙方提供的所有信息完整、准确、真实并无误导性；2）本合同的签订和履行未构成乙方作为协议一方的或受约束的任何合同、协议、保证或承诺下的违约行为；3）乙方签订和履行本合同不违反任何法律、法规、条例或任何法庭、仲裁机关或行政机关的命令、判决或决议；4）乙方未以任何形式涉及任何未决的、进行中的或有危险发生的法律行动、索赔、起诉、仲裁或行政程序等可能影响本合同履行的事件。
        </p>
        <p>
          9、乙方保证按指定用于支付的信用卡开户行的指定期限和标准偿还应支付款项，保证信用卡在分期租赁期内为正常使用状态，
          <span>
            有足够可用授信额度供甲方划扣当期应付款及对剩余分期金额进行授信额度冻结，否则甲方有权向乙方一次性收取分期租赁余额，或更换乙方名下其他信用卡划扣应支付款项，并可定期、不定期对其剩余分期金额进行授信额度冻结，直至分期支付余额全部冻结成功。
          </span>
        </p>
        <p>
          <span>
            10、
            乙方同意：乙方通过在银行办理信用卡时预留的手机号码获取支付短信验证码，在“乐百分”业务界面输入并通过短信验证步骤，则视为乙方本人操作。因乙方的过错导致的任何损失由乙方自行承担，该过错包括但不限于：不按照交易提示操作，未能及时进行交易操作，遗忘或泄露银联验证码，手机被盗、账号被盗等。
          </span>
        </p>
        <p className="title"> 第六条 违约责任：</p>
        <p>
          1、乙方发生以下情况，属于严重违约：①、乙方使用虚假身份证明文件；②、乙方提供的信用卡账户，经查核已被银行信用系统列入黑名单或被依法冻结；③、某一笔分期支付的指定支付日到期后乙方仍未完全偿还该分期支付，其账户内没有足够可用授信额度供甲方划扣当期应付款；④、乙方在与甲方签订的任何其他分期合同中有严重违约行为；⑤、乙方作出的与分期支付有关的任何陈述或保证虚假、不完整、不准确或有歧义，或乙方违背第五条所作出的任何保证、承诺或同意；⑥、甲方或债权受让方有证据证明乙方自分期租赁申请日起就分期租赁从事过任何欺诈行为或乙方可能无能力履行本合同项下的支付义务；⑦、乙方发生或可能发生影响甲方或债权受让方在本合同项下权益的任何其他情形。
          乙方发生以上第①项、第②项及第③项违约情形，将直接导致本合同提前终止，甲方及债权受让方有权要求乙方立即偿还本合同下全部剩余款项。乙方发生以上违约情形之一，则：（1）在分期租赁款项发放之前，甲方及债权受让方有权单方解除本合同而无需承担任何违约责任；或（2）在分期租赁款项发放之后，甲方或债权受让方有权要求其一次性履行本合同项下全部义务。乙方应立即偿还本合同下全部剩余应支付款项。若乙方未履行该支付义务，甲方或债权受让方有权宣布本合同提前到期，要求乙方立即一次性履行本合同项下全部义务。
        </p>
        <p>
          2、若乙方的信用卡账户未能如期成功划扣分期租赁款，或租赁转购买后的分期租赁余额（即未在某一指定支付日前或当日将相应分期支付款项全部存入支付账户，其账户内没有足够可用授信额供甲方划扣当期应支付款项），甲方及债权受让方有权保留追究的权利。
        </p>
        <p>
          3、甲方或债权受让方为执行本合同、实现合同权益所支付的所有费用（包括但不限于律师费和交通、食宿、诉讼费、评估、鉴定、登记、公证、公告、保险、保管、运输等费用）均由乙方承担。
        </p>
        <p>
          4、如因乙方原因发生包括但不限于第三条第4款之情形，而导致甲方或债权受让方无法执行扣款及授信额度担保操作时，
          <span>
            甲方或债权受让方有权向乙方一次性收取分期支付余额或按到期应支付总额收取每日0.05%的违约金，或更换乙方名下其他信用卡划扣应支付款项，并可定期或不定期对其剩余分期金额进行授信额度冻结，直至分期支付余额全部冻结成功。
          </span>
        </p>
        <p className="title"> 第七条 还款顺序：</p>
        <p>1、乙方在不同时期与甲方签订多份个人消费分期合同，清偿顺序按签订时间确定。</p>
        <p className="title"> 第八条 争议解决方式：</p>
        <p>
          1、本合同的订立、解释及争议的解决均适用中华人民共和国的法律、法规。本合同履行所发生的纠纷，双方应协商解决，协商不成的任何一方均可向本合同签订地广州市天河区人民法院提请诉讼。
        </p>
        <p>2、各方在协商、诉讼期间，对本合同项下不涉及争议的条款，仍须执行。</p>
        <p className="title"> 第九条 其他约定：</p>
        <p>
          1、本合同下乙方任何付款行为应被认定在支付账户贷记入相应款项时发生。该时间根据相关银行向甲方提供的交易记录确定。
        </p>
        <p>
          2、乙方同意，当还款通道变更或乙方信用卡状态异常时，甲方及“债权受让方”有权要求乙方一次性偿还本合同下全部剩余应支付款项。
        </p>
        <p>
          <span>
            3、在特约商户线下实体店消费时，乙方持有特约商户的消费凭证和乙方本人的真实身份证为本合同不可分割的有效组成部分，均需妥善保管；甲方特约商户验证乙方消费成功，则视为乙方本人确认已收取商品。在特约商户网上商城消费时，乙方本人的真实身份证和商品物流签收单为本合同不可分割的有效组成部分，均需妥善保管；乙方签署商品物流签收单，则视为乙方本人确认已收取商品。
          </span>
        </p>
        <p>
          4、为保障乙方权益，乙方联系电话号码等个人信息发生变动后应于5个自然日内在“乐百分”业务界面修改资料并提交给甲方或致电“乐百分”服务热线。若乙方未及时通知，甲方仍按乙方所留电话或地址寄发相关信息或信件的，均视为有效送达，由此产生的一切后果由乙方承担。
        </p>
        <p>
          5、若本合同中的任何条款被任何司法或有权机关认定为无效或不可强制执行，该条款将被从本合同中分离出来，其余条款仍应有效。
        </p>
        <p>
          6、乙方同意，若相关法律法规和信用政策发生变化，则甲方无需提前发出书面通知，也无需得到乙方的许可，甲方即有权按新的法律法规和信用政策规定处理本合同的相关事务。
        </p>
        <p>
          7、乙方同意，本合同所涉及的乙方个人资料公开给甲方、债权受让方和爱回收，以用于管理分期支付及会员信息库等方面的用途。
        </p>
        <p>
          <span>
            8、甲方有权自行转让其在本合同下（也仅限于本合同项下）的全部或部分债权给相关第三方而无需征得乙方的同意。
          </span>
        </p>
        <p>
          9、本合同采用电子文本形式，各方均认可该形式合同的法律效力。自乙方勾选“本人已全部详细阅读以上《
          “乐百分”个人消费分期支付合同》并同意全部条款”，且成功办理“乐百分”业务之日起生效。
        </p>
      </div>
    </div>
  )
}

Terms.propTypes = {
  formStatus: PropTypes.number.isRequired,
}

export default Terms
