import React from 'react'
import styles from '../common.less'

const CreditAndInfo: React.FunctionComponent<{ info: any; user_code: any }> = ({ info, user_code }) => {
  const userInfo = info.get('user_info')
  return (
    <div className={styles.container}>
      <p>附件一：个人征信及用户信息授权书</p>
      <p>
        <b>
          重要提示：本次授权文件包含《个人征信授权书》、《用户信息授权书》（统称“授权书”），为了保障您的合法权益，请您务必审慎阅读、充分理解授权
          书条款内容，特别是您在授权书范围内的权利和义务。
        </b>
      </p>
      <p>
        <b>
          您的点击确认及业务申请使用等行为即视为您已阅读、理解并同意签署《个人
          征信授权书》、《用户信息授权书》，并授权众安在线财产保险股份有限公司向合作的电子合同服务商代您申请开通及调用您的电子签名，以签署授权书。
          您认可电子签名签署授权书的法律效力，并受签署的授权书约束。如授权书包含至相应业务协议中，对相应业务协议接受同意即视为您已阅读、理解并同意
          授权书内容。
        </b>
      </p>
      <h2 className={styles.center}>个人征信授权书</h2>
      <p>众安在线财产保险股份有限公司：</p>
      <p>
        本人<span className={styles.fill}>{userInfo.get('user_name')}</span>,身份证号码<span className={styles.fill}>
          {userInfo.get('user_id_card')}
        </span>,本人同意在本人作为投保人、被保险人
        以及保险标的的履约义务人与贵公司办理或涉及本人的如下信用保证保险业务或事项中：<b>
          1、保前审核；2、保中管理；3、保后管理（包括保险理赔与追偿）；4、处理本人征信异议
        </b>， 就本人的个人征信信息作出以下授权并清楚理解其含义：
      </p>
      <p>
        <b>
          (一)本人同意授权贵公司自行或委托第三方机构向中国人民银行金融信用信息基础数据库、其他依法成立的征信机构查询、打印、留存、使用本人的个
          人信息、信用信息及上述机构留存的本人其他全部信息。
        </b>
      </p>
      <p>
        <b>贵公司超出授权查询的一切后果及法律责任由贵公司自行承担。</b>
      </p>
      <p>
        <b>
          (二)本人同意授权贵公司自行或委托第三方机构向中国人民银行金融信用信息基础数据库、其他依法成立的征信机构提供、报送、上传因本业务或事项
          产生的本人全部信息（包括信用保证保险业务中产生的不良信息等）。如本人未按时还款，本人同意并授权贵公司自按保险合同约定履行赔付义务之日起60
          个自然日（含）内向上述机构提供、报送、上传本人不良信息。
        </b>上述机构可依法对本人信息进行整理、保存、加工、使用、提供，并出具个人模型结果。本人
        已清楚知悉提供上述信息可能会给本人带来财产或信用损失，以及其他可能的不利后果，包括但不限于：<b>
          采集这些信息对本人的信用评级(评分)、信用报告等
          结果可能产生的不利影响，以及该等信息被信息使用者依法提供给第三方后被他人不当利用的风险。
        </b>
      </p>
      <p>
        <b>
          （三）以上授权的期限为本人作出本授权承诺之日起至本人在贵公司办理或涉及的所有业务或事项终结之日止。若本人在贵公司处办理或涉及的业务未
          获批准，本人同意贵公司继续保留此查询授权书原件和身份证复印件或影印件。
        </b>
      </p>
      <p>
        <b>特别提示:</b>
      </p>
      <p>
        若本人与被授权人发生因本授权书而产生的任何纠纷或争议，首先应友好协商解决；协商不成的，本人同意将纠纷或争议提交至上海仲裁委员会仲裁解决。
        本授权书的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。
      </p>
      <p>本人承诺本授权书生效后即不可撤销且具有独立性，不因相关业务合同或条款无效或被撤销而无效或失效。</p>
      <p>
        <b>
          本人已知悉本授权书全部内容(特别是加粗字体内容)的含义及因此产生的法律效力，自愿做出以上授权。本授权是本人真实意思表示，本人愿意承担由
          此带来的一切法律后果。
        </b>
      </p>
      <p>
        <b>特此授权！</b>
      </p>
      <p>
        授权人: <span className={styles.fill}>{userInfo.get('user_name')}</span>
        <label className={styles.union_code} style={{ color: '#fff' }}>
          {user_code}
        </label>
      </p>
      <p>
        日期: <span className={styles.fill}>{info.get('year')}</span>年<span className={styles.fill}>
          {info.get('month')}
        </span>月<span className={styles.fill}>{info.get('day')}</span>日
      </p>
      <br />
      <br />
      <br />
      <h2 className={styles.center}>用户信息授权书</h2>
      <p>众安在线财产保险股份有限公司：</p>
      <p>
        本人<span className={styles.fill}>{userInfo.get('user_name')}</span>,身份证号码<span className={styles.fill}>
          {userInfo.get('user_id_card')}
        </span>,本人同意在本人作为投保人、被保险人以及保险标的的履约义务人与贵公司办理或涉及本人的如下信用保证保险业
        务或事项中：<b>
          1、保前审核；2、保中管理；3、保后管理（包括保险理赔与追偿）；4、依法或经有权部门要求或相关业务协议约定等，
        </b>就本人个人信息作出以下授 权并清楚理解其含义：
      </p>
      <p>
        <b>
          （一）本人同意贵公司有权搜集、保留、使用、加工本人与贵公司办理上述业务或事项过程中提供的全部信息，包括但不限于本人姓名、身份证件类型、
          证件号码、手机号码、银行卡号等。
        </b>
      </p>
      <p>
        <b>
          （二）本人同意授权贵公司自行或委托第三方机构向如下机构查询、打印、留存、使用本人的基本、信用、通讯、交易、公共事业、缴税、借贷、财产信
          息及如下机构留存的本人其他全部信息：
        </b>
      </p>
      <p>
        <b>
          1.行政机关、事业单位、司法机关、监管部门、中国互联网金融协会、中国支付清算协会等有权部门、行业自律组织等；
        </b>
      </p>
      <p>
        <b>2.有资质的数据服务公司；</b>
      </p>
      <p>
        <b>3.其他有权留存本人信息的机构等。</b>
      </p>
      <p>
        <b>
          （三）本人同意授权贵公司将本人信息用于与上述业务有关的身份验证、信息准确性验证、资格审核、信用评估、客户服务、安全防范、诈骗监测、存
          档和备份等用途，以确保贵公司提供的产品和服务的适当性和安全性。同时，贵公司有权按照相关法律法规及监管要求进行本人身份证件核对和实名信息查
          验登记。
        </b>
      </p>
      <p>
        <b>
          （四）本人同意授权贵公司自行或将本人信息传递至具备合法资质的第三方机构并委托其对本人信息进行实名验证、密码验证、短信验证、银行卡鉴权
          等一个或多个方式验证。
        </b>
      </p>
      <p>
        <b>
          （五）以上授权的期限为本人作出本授权承诺之日起至本人在贵公司办理或涉及的所有业务或事项终结之日止。若本人在贵公司处办理或涉及的业务未
          获批准，本人同意贵公司继续保留此查询授权书原件和身份证复印件或影印件。
        </b>
      </p>
      <p>
        <b>特别提示:</b>
      </p>
      <p>
        若本人与被授权人发生因本授权书而产生的任何纠纷或争议，首先应友好协商解决；协商不成的，本人同意将纠纷或争议提交至上海仲裁委员会仲裁解决。
        本授权书的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。
      </p>
      <p>本人承诺本授权书生效后即不可撤销且具有独立性，不因相关业务合同或条款无效或被撤销而无效或失效。</p>
      <p>
        <b>
          本人已知悉本授权书全部内容(特别是加粗字体内容)的含义及因此产生的法律效力，自愿做出以上授权。本授权是本人真实意思表示，本人愿意承担由
          此带来的一切法律后果。
        </b>
      </p>
      <p>
        <b>特此授权！</b>
      </p>
      <p>
        授权人: <span className={styles.fill}>{userInfo.get('user_name')}</span>
        <label className={styles.union_code} style={{ color: '#fff' }}>
          {user_code}
        </label>
      </p>
      <p>
        日期: <span className={styles.fill}>{info.get('year')}</span>年<span className={styles.fill}>
          {info.get('month')}
        </span>月<span className={styles.fill}>{info.get('day')}</span>日
      </p>
    </div>
  )
}

export default CreditAndInfo
