import React from 'react'
import styles from '../common.less'

const RentContract: React.FunctionComponent<{ info: any; crop_code: any; user_code: any }> = ({
  info,
  crop_code,
  user_code,
}) => {
  const userInfo = info.get('user_info')
  const skuInfo = info.get('sku_info')
  const tradeInfo = info.get('trade_info')
  return (
    <div className={styles.container} style={{ marginTop: 0 }}>
      <h1 className={styles.center}>融资租赁合同</h1>
      <p>
        <b>
          特别提醒：在您（本协议中称为“乙方/承租方”）确认签署本合同（包括附件，下同）之前，请您务必充分阅读本合同所有条款，尤其是加粗部分。如您对本合同内容及服务页
          面有任何疑问，请您暂停操作。您确认并知晓本合同由正文、附件《个人征信及用户信息授权书（通用）》《委托代扣授权书》两部分组成。
        </b>
      </p>
      <p>
        <b>
          一旦您通过点击或其他方式确认本合同，即意味着您已阅读本合同所有条款、已清楚知悉并充分理解本产品的所有信息，并对本合同条款的含义及相应的法律后果已全部通晓并
          充分理解，同意以数据电文形式自愿与甲方、丙方订立本合同，同意接受本合同约束。
        </b>
      </p>
      <br />
      <p>
        甲方：<span className={styles.fill}>众联融资租赁（上海）有限公司</span>
      </p>
      <p>
        地址：<span className={styles.fill}>上海市虹口区四川北路859号中信广场4602-4603</span>
      </p>
      <p>
        联系方式：<span className={styles.fill}>021-66289135</span>
      </p>
      <p>
        客服电话：<span className={styles.fill} />
      </p>
      <br />
      <p>
        乙 方：<span className={styles.fill}>{userInfo.get('user_name')}</span>
      </p>
      <p>
        身份证号：<span className={styles.fill}>{userInfo.get('user_id_card')}</span>
      </p>
      <p>
        收货地址：<span className={styles.fill}>{tradeInfo.get('delivery_address')}</span>
      </p>
      <p>
        联系方式：<span className={styles.fill}>{userInfo.get('user_phone')}</span>
      </p>
      <br />
      <p>
        丙方：<span className={styles.fill}>晋松（上海）网络信息技术有限公司</span>
      </p>
      <p>
        地址：<span className={styles.fill}>上海市杨浦区国定路323号1002-75室</span>
      </p>
      <p>
        联系方式：<span className={styles.fill}>400-670-0188</span>
      </p>
      <p>
        客服电话：<span className={styles.fill}>400-670-0188</span>
      </p>
      <br />
      <p>
        <b>乙方确认并承诺：</b>
      </p>
      <p>
        <b>
          1.乙方提供的姓名、身份证号等个人信息均真实有效，通过乙方提供的地址寄送的任何文书均视为乙方已收到该文书。对于因本协议争议引起的任何纠纷，乙方声明司法机
          关（包括但不限于人民法院）可以通过手机短信或电子邮件等现代通讯方式或邮寄方式向乙方送达法律文书（包括但不限于诉讼文书）。如有变更，乙方应当至少提前五
          个工作日书面通知甲方。如乙方未及时书面通知变更信息，导致法律文书送达不能的法律后果由乙方自行承担。
        </b>
      </p>
      <p>
        <b>
          2.乙方在【享换机】平台以乙方名义注册且经过实名认证并设置密码的个人账户所从事的所有行为均视为乙方本人行为（包括但不限于订立本合同），该等行为的法律后果
          均由乙方承担。
        </b>
      </p>
      <p>鉴于：</p>
      <p>
        1.乙方为年满18周岁具有完全民事行为能力的自然人，因具有手机设备使用的需求，有意在丙方”享换机”平台以融资租赁方式向出租人甲方申请手机设备租赁服务，并因此接
        受甲方和丙方提供的相关服务。乙方确认并知晓丙方同时为该平台产品的提供方，亦为本融资租赁产品的供货商。
      </p>
      <p>
        2.甲方基于乙方对供货商、租赁产品的选择，向丙方或丙方推荐的供应商购买租赁产品并支付价款，从而取得租赁产品的所有权。
      </p>
      <p>
        3.各方达成融资租赁方案，同意在符合本合同约定的前提下，甲方将融资租赁产品租赁给乙方使用，乙方按照本合同约定向甲方支付租金及其他款项。
      </p>
      <p>4.各方经平等协商，就融资租赁事宜达成本融资租赁合同，以资共同遵守。</p>
      <br />
      <h2>一、融资租赁方案</h2>
      <p>
        商品名称：<span className={styles.fill}>{skuInfo.get('sku_name')}</span>；
      </p>
      <p>
        商品规格：<span className={styles.fill}>{skuInfo.get('sku_name')}</span>；
      </p>
      <p>
        租赁期限：自租赁产品获得日（起租日）起<span className={styles.fill}>{tradeInfo.get('lease_term_periods')}</span>个月；
      </p>
      <p>
        租金总额：<span className={styles.fill}>{tradeInfo.get('rent_price')}</span>元；
      </p>
      <p>
        前12个期（月）各期租金额：<span className={styles.fill}>{tradeInfo.get('term_rent_price')}</span>元，后12个期（月）各期租金金额：<span
          className={styles.fill}
        >
          {tradeInfo.get('after_rent_price')}
        </span>元；
      </p>
      <p>
        押金预授权金额：<span className={styles.fill}>{tradeInfo.get('deposit_total_price')}</span>元；
      </p>
      <p>
        12期提前买断价款：<span className={styles.fill}>{tradeInfo.get('residual_value_price')}</span>元。
      </p>
      <p>
        24期到期买断价款：<span className={styles.fill}>{tradeInfo.get('twenty_four_rent_price')}</span>元。
      </p>
      <p>租赁产品的处置：</p>
      <p>
        （1）租赁期满12期（月）且乙方正常或提前支付12期全部租金等所有应付款项的情况下，乙方有权于12期结束前【30
        】日至12期限到期前通过丙方平台申请提前归还或提前买断租赁产品。 提前归还及买断规则根据本协议内容执行。
      </p>
      <p>
        （2）租赁期满24期（月）且乙方正常或提前支付24期全部租金等所有应付款项的情况下，乙方有权于24期结束前【30】日至24期限到期前通过丙方平台申请到期归还或到期买断租赁产品。
        到期归还及到期买断规则根据本协议内容执行。
      </p>
      <p>
        （3）若本协议下到期租赁产品的买断价格为0元时，则乙方正常或提前支付24期全部租金等所有应付款项的，租赁产品的所有权自动转移至乙方。
      </p>
      <p>
        （4）乙方确认知晓乙方能且仅能在前款所述时间内申请提前归还或买断租赁产品。若乙方未在前款所述时间内发起申请，则乙方无权再次申请提前归还或买断。
      </p>
      <h2>二、租金的支付方式</h2>
      <p>
        2.1.乙方在此不可撤销地同意并授权甲方或其委托方（丙方）向第三方支付机构或银行发出扣划指令，由第三方支付机构或银行，从乙方绑定的或指定的银行账户中扣划乙方应当
        支付的租金、逾期违约金（如有）、到期买断费用等其他应当由乙方支付的款项。
      </p>
      <p>
        2.2.乙方在绑定或指定银行账户中必须留有足够余额，如因账户余额不足或不可归责于甲方、丙方、第三方支付机构、银行的任何事由，导致无法及时扣划或扣划错误、失败，由此
        产生的责任由乙方承担。
      </p>
      <h2>三、押金预授权</h2>
      <p>
        3.1.乙方授权丙方于本合同签订后冻结一定金额的信用额度（含花呗、信用卡及/或其他乙方同意的额度）作为押金预授权，并在以下情况下使用：
      </p>
      <p>
        (1)当乙方未按本合同约定支付各期租金时，丙方有权对预授权金额中相当于当期未付租金、违约金（如有）的部分向相应授信额度主体发起支付申请，并
        将所口代乙方用于支付租金、违约金（如有）；
      </p>
      <p>
        (2)租赁满12期或24期，乙方申请提前或到期归还租赁产品的，但乙方未按约定归还租赁产品或者归还租赁产品不符合还机标准，视为乙方提前或到期买
        断，丙方有权对预授权金额中相当于提前或到期买断价款部分进行划扣，代乙方用于支付买断价款；
      </p>
      <p>
        (3)租赁满12期或24期，乙方申请提前或到期买断租赁产品的，但乙方未按约定支付买断价款，丙方有权对预授权金额中相当于提前或到期买断价款部分
        进行划扣，代乙方用于支付买断价款；
      </p>
      <p>(4)当本合同履行完毕时（含提前买断、提前还机等各种情况下），丙方释放所有未使用的预授权额度。</p>
      <p>3.2.具体押金预授权金额以第一条约定为准。</p>
      <p>
        3.3.押金预授权冻结期间需覆盖本协议项下融资租赁的租赁期间，融资租赁合同存续期间乙方不得以任何方式阻止、解除对乙方额度的冻结。
      </p>
      <p>3.4.乙方知晓并同意押金预授权的额度在租赁期间不因乙方正常支付租金等任何理由而发生变动。</p>
      <h2>四、租赁产品的交付及质量瑕疵问题</h2>
      <p>
        4.1.租赁产品由甲方委托丙方或其推荐供应商直接交付给乙方，丙方或其推荐供应商应在本协议签署后24小时内完成发货。
      </p>
      <p>
        4.2.乙方选择【物流人员上门配送方式】交付租赁产品的，则乙方应当配合物流人员当面验收，包括核实租赁产品型号、IMEI号与合同是否一致、全新设备是否已拆封等，乙方
        在验收时发现任何问题均需立即与甲方客服人员联系并拒收租赁产品。如乙方在签收前未联系甲方客服人员，则视为乙方对租赁产品验收合格，租赁产品甲方已完成交付。
      </p>
      <p>
        4.3.各方同意，非因甲方原因导致的租赁产品延迟交付、存在质量问题的，乙方需将该情形及时通知甲方，并在下列情形时有权拒绝接收租赁产品：
      </p>
      <p>(1)租赁产品严重不符合约定的；</p>
      <p>(2)供货商未在约定的交付期间或者合理期间内交付租赁产品，经乙方或者甲方催告，在催告期满后仍未交付的。</p>
      <p>
        4.4.租赁产品交付后7天内，乙方可以按照本合同第五条规定享受退换货服务：但退换货流程发起不得晚于自甲方交付完毕之日起7天（含），否则视为乙方取得租赁产品并对租
        赁产品不存在任何异议。
      </p>
      <h2>五、消费者退换货及还机条款</h2>
      <p>5.1.租赁产品交付后，乙方享受退换货服务如下：</p>
      <p>(1)7天无理由退货：租赁产品签收后7日内若未拆封，未激活，可申请无理由退货。</p>
      <p>
        (2)换货：签收后15日内，租赁产品为安卓全新设备的，存在非人为因素导致的设备本身质量问题的，且未拆封未激活，可以申请换货；租赁产品为苹果全新设备
        的，签收后存在非人为因素导致的设备本身质量问题的，可以寄回出卖方维修。为免歧义，如乙方申请换货，租赁起始日不变，且换货设备应为同一型号。
      </p>
      <p>
        (3)签收15天后意外保障服务生效，在租赁服务期内若发生碎屏等意外保障服务内的损坏，维修费用累计不超过产品保额上限的，享受免费维修。详见《意外保障
        服务条款》。
      </p>
      <p>
        5.2.还机：租赁期限满12期、24期前【30】日，乙方通过丙方平台申请提前还机的，乙方需将租赁产品归还至甲方指定地点。若乙方无法归还至指定地点，需提前告知甲方，选
        择其他还机方式；逾期未归还，则甲方（若届时甲方已将相关权利转让给丙方的，则为丙方）有权要求乙方支付买断价款，以购买租赁产品。
      </p>
      <p>
        5.3.还机标准：参照《还机标准》，如有不符合《还机标准》的情况，均视为乙方无法还机，则甲方（若届时甲方已将相关权利转让给丙方的，则为丙方）有权要求乙方支付买断价
        款，以购买租赁产品。
      </p>
      <table
        style={{
          borderCollapse: 'collapse',
          borderSpacing: '0',
          fontSize: '12px',
          backgroundColor: '#fff',
          textAlign: 'center',
          marginBottom: '15px',
          width: '100%',
        }}
      >
        <thead>
          <tr>
            <th colSpan={5}>还机标准</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td colSpan={5} style={{ backgroundColor: '#f9f9f9' }}>
              1、外观成色标准
            </td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(1)、边框背板：机身无弯曲，边框无断裂，玻璃背板无碎裂</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(2)、屏幕外观：屏幕无碎裂</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(3)、屏幕显示：屏幕显示无色斑、漏液、错乱、严重老化、无法正常显示等</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5}>(4)、拆修历史：无私自拆修，手机背板、系统、卡槽IMEI一致</td>
          </tr>
          <tr style={{ padding: '0 5px' }}>
            <td colSpan={5} style={{ backgroundColor: '#f9f9f9' }}>
              2、功能质检标准
            </td>
          </tr>
          <tr>
            <td style={{ padding: '0 5px' }}>(1)充电功能正常</td>
            <td style={{ padding: '0 5px' }}>(2)无线功能正常</td>
            <td style={{ padding: '0 5px' }}>(3)正常开机</td>
            <td style={{ padding: '0 5px' }}>(4)账号功能正常</td>
            <td style={{ padding: '0 5px' }}>(5)指纹功能正常</td>
          </tr>
          <tr>
            <td style={{ padding: '0 5px' }}>(6)指针功能正常</td>
            <td style={{ padding: '0 5px' }}>(7)拍照摄像功能正常</td>
            <td style={{ padding: '0 5px' }}>(8)机身无进水</td>
            <td style={{ padding: '0 5px' }}>(9)触摸功能正常</td>
            <td style={{ padding: '0 5px' }}>(10)指南针功能正常</td>
          </tr>
        </tbody>
      </table>
      <p>
        5.4.若服务期内发生故障，经甲方工程师检测，租赁产品损坏程度超出意外保障服务范围，则甲方有权拒绝维修，乙方仍然需要按照本协议约定按期支付租金。
      </p>
      <p>
        5.5.租赁产品意外损坏等原因需将租赁产品往返寄送时，各方均应通过顺丰快递进行寄送，快递费遵循“谁寄送谁承担”的原则，同时物流保价费需由各自方承担。顺丰快递在寄
        送过程中可能会依照国家相关规定进行拆包验视，如果到件新机已拆封未激活，也视为符合设备交付标准，不予退换。
      </p>
      <p>5.6.租赁产品若为非手机类产品，相应的退换货标准另行书面约定。</p>
      <h2>六、各方的权利义务</h2>
      <p>6.1.甲方的权利义务：</p>
      <p>
        6.1.1.乙方签订本合同即视为授权甲方使用乙方的真实身份信息通过第三方信用认证，并获得其在第三方信用认证平台的信用信息。
      </p>
      <p>
        6.1.2.甲方有权根据相关适用法律，将在租赁期间获得的乙方个人基本信息、债务信息、信用信息（即适用法律规定的对乙方信用状况的客观状态）等有关信息，提供给合
        作机构对乙方进行还款提醒、催收等督促乙方履行义务。
      </p>
      <p>
        6.1.3.根据相关监管要求，甲方对乙方的个人基本信息、债务信息、信用信息等有关信息有权予以保留。甲方对该等信息负有保密的义务，除根据相关法律法规、本协议的
        相关约定、或出于为乙方提供更好的服务之目的、需将乙方信息进行对外提供的情形之外，未经乙方允许，甲方不得擅自将乙方信息披露或提供给任何与协议无关的其他方。
      </p>
      <p>
        6.1.4.租赁期间，甲方根据与丙方签署的《业务合作协议》约定将融资租赁标的物转让给有丙方，同时将本协议项下的权利义务转让给丙方的，则乙方需按照本合同的约定继
        续向丙方履行义务。甲方可自行或委托“享换机”平台以邮件、短信、站内信等其他方式将该转让信息通知乙方在甲方预留的联系方式且视为视为通知送达。
      </p>
      <p>
        6.1.5.租赁期间，租赁产品所有权归属于甲方。租赁满12期，乙方申请提前买断租赁产品并支付提前买断价款的，租赁产品所有权转移至乙方，本协议自动终止。本协议
        下租赁期满，乙方申请到期买断租赁产品并足额支付到期买断价款的，租赁产品所有权自动转移至乙方（包括到期买断价款为0元，租赁期满乙方自动获得租赁产品
        所有权），本协议自动终止。除此以外，租赁产品的所有权归属于甲方所有，乙方应当按照本协议约定向甲方归还租赁产品。
      </p>
      <p>
        6.1.6.对于乙方归还的设备，甲方将自行或委托丙方抹除设备所有数据，并将其恢复至出厂设置。甲方无义务保存或保管设备中相关信息。
      </p>
      <p>
        6.1.7.甲方有权就本协议项下融资租赁所产生的债权向众安在线财产保险股份有限公司申请信用保证投保，具体险种、条款及费用，以甲方和保险公司约定为准。
      </p>
      <p>
        6.1.8.甲方有权在乙方承租满12期，且正常支付租金的情况下，于第12期结束后要求丙方承接本协议下甲方的全部权利和义务。乙方按照本协议约定选择提前还机、提
        前买断或续租的，均通过丙方平台提出申请，并由丙方为乙方提供相应后续服务。
      </p>
      <p>6.2.乙方的权利义务：</p>
      <p>
        6.2.1.乙方应保证合法使用租赁产品。租赁期间，未经甲方书面同意，不得将租赁产品转让、转租、抵押、质押、投资入股或者以其他方式处分租赁产品。
      </p>
      <p>
        6.2.2.乙方在此不可撤销地同意并授权甲方或其委托方（丙方）：向第三方支付机构或银行发出扣划指令，由第三方支付机构或银行，从在甲方或其委托方（丙方）绑定的
        或指定的银行账户中扣划乙方应当支付的租金、逾期违约金（如有）等其他应当由乙方支付的款项。
      </p>
      <p>
        6.2.3.乙方在绑定或指定银行账户中必须留有足够余额，如因账户余额不足或不可归责于甲方、丙方、第三方支付机构、银行的任何事由，导致无法及时扣划或扣划错误、
        失败，由此产生的责任由乙方承担。
      </p>
      <p>
        6.2.4.<b>当乙方的联系方式变化或资信状况及收入状况出现重大不利影响时，乙方应及时通知甲方。</b>
      </p>
      <p>
        6.2.5.乙方不得以出租、转借或以其他方式将使用服务过程中的相关账户、密码、身份证件信息、手机号码、银行卡信息、住址、邮箱等信息交由任何其他第三方使用，否
        则由此导致的损失及相关后果由乙方承担。
      </p>
      <p>
        6.2.6.乙方明确对于甲方进行如下授权：授权甲方及甲方委托的第三方通过合法渠道了解、咨询、审查乙方的身份信息、资信状况、财务状况和其他与评定乙方信用状况及付
        款能力有关的信息，并可以在甲方提供融资租赁服务整个过程中及在追偿违约欠款时索取、留存和使用该信息及乙方在甲方所提供的全部资料；授权甲方及其合作方
        接入征信机构共享系统并查询、披露乙方的相关信用信息。
      </p>
      <p>
        6.2.7.乙方确认并知晓乙方占有租赁产品期间，租赁产品毁损、灭失的风险由乙方承担，甲方有权要求要求乙方继续支付租金。乙方应当履行占有租赁产品期间的维修义务。
      </p>
      <p>
        6.2.8.乙方知晓并同意，乙方有权按照本协议约定发起提前还机或提前买断申请，但是该申请的发起需当且仅当在租赁期第12个月前【30】日内，乙方通过享换机平台向
        甲方发起提前还机或提前买断申请的，乙方申请需经甲方审核，审核通过后，乙方按照本协议约定提前归还或者提前买断设备。
      </p>
      <p>
        6.2.9.乙方知晓并同意，乙方应按照协议约定履行承租人的义务，除本协议约定外，无合理理由不得在租赁期满前要求退租。若乙方要求退还租赁物，则视为乙方违约，乙
        方需按照本协议第七条违约责任条款承担违约责任。
      </p>
      <p>
        6.2.10.乙方申请提前或到期还机后，经甲方检测认定属如下情况的、或者在本协议另有约定的情形下，甲方有权要求乙方将租赁产品予以买断，该等情况下：
      </p>
      <p>(1)因自然灾害、被盗、遗失、人为事故等原因造成机器灭失，无法归还的；</p>
      <p>(2)因机器串码标签缺失、损坏、涂改、字迹模糊等原因而无法确定是否为原机器的；</p>
      <p>(3)乙方从事非法活动导致机器发生损失的；</p>
      <p>
        (4)机器存在毁灭性损坏，设备严重损坏、弯折、机壳分离、内屏损坏、机身内组件（线缆）断裂破损或被强行拆成数块的；
      </p>
      <p>(5)机器进水、进液的；</p>
      <p>(6)机器无法正常开机、无法进行系统恢复激活后读取设备序列号或IMEI编号的；</p>
      <p>(7)机器擅自拆机、改装、维修的；</p>
      <p>(8)机器型号、S/N号、IMEI号等在进行系统恢复后与合约记载的不符，涂改、缺失或无法辨识的；</p>
      <p>(9)机器因加装、移除或改动硬件所造成的故障，包括因安装未授权的软件而导致的设备无法正常使用或故障。</p>
      <p>(10)其他不符合《还机标准》的情况。</p>
      <p>6.3.丙方的权利义务：</p>
      <p>
        6.3.1.为本合同下融资租赁服务的平台提供方，亦为本融资租赁项下手机设备租赁产品的供应商或推荐方，并为本合同甲方、乙方提供相应设备租赁产品及其他相关支持服务。
      </p>
      <p>
        6.3.2.丙方有权根据本协议约定冻结乙方一定金额的信用额度作为押金预授权，并在符合本协议第三条的情况下转为支付。
      </p>
      <p>
        6.3.3.丙方为本协议下的乙方提供购买意外保障服务。乙方签收15天后意外保障服务生效，在服务期内若发生碎屏等意外保障服务内的损坏，维修费用累计不超过产品保
        额上限的，享受免费维修。详见丙方网站/APP等网络平台所列示《意外保障服务条款》。
      </p>
      <p>6.3.4.丙方应当于乙方承租满12期后承接本协议下甲方的全部权利和义务，并按照本协议约定为乙方提供相应后续服务。</p>
      <p>
        6.3.5.无论乙方是否违约，丙方作为服务提供方，负责解决与租赁物品交付、租押金收取、产品质量、负面舆论等不利于甲方的任何纠纷。
      </p>
      <h2>七、违约条款</h2>
      <p>
        7.1.当事人一方不履行合同义务或者履行合同义务不符合约定的，应当承担继续履行、采取补救措施或者赔偿损失等违约责任。
      </p>
      <p>
        7.2.乙方逾期支付租金等费用的，甲方在要求乙方继续履行协议外有权按照乙方未支付金额日万分之五的标准向乙方另行收取逾期违约金。
      </p>
      <p>
        7.3.乙方逾期支付租金、买断价款、违约金超过30天的情况下，甲方有权要求解除融资租赁合同，取回租赁产品，并且要求乙方赔偿甲方损失。甲方损失的计算标准为：甲方损
        失=乙方全部未付租金+逾期违约金。
      </p>
      <p>
        7.4.乙方承诺，不会对外散布有损甲方利益的任何不良言论。因乙方违反该规定，对甲方声誉、品牌或形象造成严重损害后果的，甲方将通过法律手段追究乙方的民事责任，情节
        严重的，甲方有权向公安机关报案。
      </p>
      <p>
        7.5.乙方明确知晓并同意除非本协议另有约定，乙方不得提前退租，否则视为乙方违约需向甲方承担违约责任。乙方确因特殊原因无法继续承租并申请退租，需提前7日在【享
        换机】平台申请退租，经甲方同意并向甲方支付全部剩余租金、逾期违约金（如有）后 方可解除本合同。
      </p>
      <h2>八、法律适用与争议解决</h2>
      <p>
        本合同的签订、生效、履行均适用中华人民共和国法律（不含香港、澳门特别行政区法律）。本合同履行中发生争议，可由各方协商解决。协商不成的，任何一方均有权向上海仲
        裁委员会申请仲裁。
      </p>
      <h2>九、免责条款</h2>
      <p>
        本协议有效期内，因国家相关主管部门颁布、变更的法律法规、政策导致甲方不能提供约定服务的，不视为其违约，各方可根据相关的法律法规、政策变更协议内容或提前终止本协议。
      </p>
      <h2>十、其他</h2>
      <p>10.1.本合同采用电子文本形式，各方均认可该形式的协议效力。</p>
      <p>
        10.2.本合同经过各方的电子签名及/或网络点击方式签署之日起生效，并保存在“享换机”相关网络、APP平台，各方均认可该形式的协议效力。
      </p>
      <h2>附件一：个人征信及用户信息授权书（通用）</h2>
      <h2>附件二：委托代扣授权书</h2>
      <p>(以下无正文)</p>
      <br />
      <br />
      <p>
        甲方：<span className={styles.fill}>众联融资租赁（上海）有限公司</span>
      </p>
      <p>
        乙方：<span className={styles.fill}>{userInfo.get('user_name')}</span>
        <label className={styles.union_code} style={{ color: '#fff' }}>
          {user_code}
        </label>
      </p>
      <p>
        丙方：<span className={styles.fill}>晋松（上海）网络信息技术有限公司</span>
      </p>
      <p>
        日期：<span className={styles.fill}>{info.get('year')}</span>年<span className={styles.fill}>
          {info.get('month')}
        </span>月<span className={styles.fill}>{info.get('day')}</span>日
        <span style={{ color: '#fff' }}>空格空格空格空格空格空格</span>
        <label className={styles.union_code} style={{ color: '#fff' }}>
          {crop_code}
        </label>
      </p>
    </div>
  )
}

export default RentContract
